{
  "standard": "EN 197-1",
  "cement_types": [
    {
      "name_with_color_prefix": "G CEM I 32.5N",
      "technical_name": "CEM I 32.5N",
      "standard_name_display": "GRAY CEM I 32.5N, EN 197-1",
      "definition": "أسمنت بورتلندي تقليدي رمادي، يُعرف بالرمز GRAY CEM I 32.5N، كما حددته المواصفة الأوروبية EN 197-1. يُعرَّف الأسمنت بأنه رابط هيدروليكي، أي مادة غير عضوية مطحونة ناعمًا، عند خلطها بالماء، تشكل عجينة تتصلب وتتصلد بفعل تفاعلات وعمليات الإماهة، وتحتفظ بقوتها واستقرارها بعد التصلب حتى تحت الماء. يُصنف هذا النوع ضمن الفئة CEM I، والتي تتكون أساسًا من الكلنكر البورتلندي، مع نسبة صغيرة جدًا من المكونات الثانوية الإضافية. الرمز \"32.5\" يشير إلى فئة مقاومة الضغط الدنيا بعد 28 يومًا، أي لا تقل عن 32.5 ميجا باسكال، ويجب ألا تزيد مقاومة الضغط عن 52.5 ميجا باسكال. الحرف N يدل على أن الأسمنت ذو مقاومة مبكرة عادية Normal Early Strength. يجب أن يكون مجموع نسب أكسيد الكالسيوم التفاعلي CaO وثاني أكسيد السيليكون التفاعلي SiO₂ في الأسمنت لا يقل عن 50% بالكتلة.",
      "composition": {
        "clinker_k": {
          "percentage": ">= 95%",
          "details": [
            "الكلنكر هو مادة هيدروليكية تتكون من حرق خليط دقيق ومجهز من المواد الخام، مثل الحجر الجيري والطين، في فرن دوار.",
            "يجب أن يتكون الكلنكر من ثلثي كتلته على الأقل من سيليكات الكالسيوم، وأهمها Ca₃SiO₅ و Ca₂SiO₄.",
            "يجب ألا تقل نسبة CaO/SiO₂ بالكتلة عن 2.0.",
            "يجب ألا يتجاوز محتوى أكسيد المغنيسيوم MgO في الكلنكر 5.0% بالكتلة."
          ]
        },
        "minor_additional_constituents": {
          "percentage": "<= 5%",
          "description": "هي مواد معدنية غير عضوية طبيعية أو مشتقة من عملية إنتاج الكلنكر، أو مواد أخرى محددة في المواصفة، تُضاف لتحسين الخصائص الفيزيائية للأسمنت، مثل القابلية للتشغيل أو الاحتفاظ بالماء. يمكن أن تكون خاملة أو ذات خصائص هيدروليكية طفيفة، أو هيدروليكية كامنة، أو بوزولانية. يجب ألا تزيد بشكل ملحوظ من طلب الماء للأسمنت أو تضعف مقاومة الخرسانة أو المونة للتدهور، أو تقلل من حماية حديد التسليح من التآكل.",
          "allowed_materials": [
            "خبث الأفران العالية S",
            "غبار السيليكا D",
            "بوزولانا طبيعية P",
            "بوزولانا طبيعية مكلسنة Q",
            "رماد متطاير سيليسي V",
            "رماد متطاير كلسي W",
            "طفلة محروقة T",
            "حجر جيري L (CaCO₃ فيه ≥ 75%)",
            "حجر جيري نقي LL (CaCO₃ فيه ≥ 75% و TOC ≤ 0.20%)"
          ]
        },
        "calcium_sulfate": {
          "percentage_typical": "3% - 5%",
          "purpose": "للتحكم في زمن الشك.",
          "forms": [
            "جبسًا (CaSO₄·2H₂O)",
            "هيمي هيدرات (CaSO₄·½H₂O)",
            "أنهيدريت (CaSO₄)",
            "خليطًا منها"
          ]
        },
        "chemical_additives": {
          "total_percentage_max": "<= 1.0% (باستثناء الأصباغ)",
          "organic_additives_dry_basis_max": "<= 0.5%",
          "notes": "مواد تُضاف لتحسين عملية التصنيع أو خصائص الأسمنت، غير مشمولة في المكونات الرئيسية أو الثانوية أو كبريتات الكالسيوم. يجب ألا تُشجع على تآكل حديد التسليح أو تضعف خصائص الأسمنت أو الخرسانة."
        }
      },
      "mandatory_physical_properties": [
        {"property": "Compressive Strength (7 days)", "unit": "MPa", "value": ">= 16.0"},
        {"property": "Compressive Strength (28 days, standard strength)", "unit": "MPa", "value_min": ">= 32.5", "value_max": "<= 52.5"},
        {"property": "Initial Setting Time", "unit": "minutes", "value": ">= 75"},
        {"property": "Soundness (Le Chatelier expansion)", "unit": "mm", "value": "<= 10"},
        {"note": "لا يوجد متطلب إلزامي لمقاومة الضغط بعد يومين لفئة القوة N."}
      ],
      "mandatory_chemical_properties": [
        {"property": "Sulfur Trioxide (SO₃) for strength class 32.5", "unit": "% by mass", "value": "<= 3.5"},
        {"property": "Chlorides (Cl)", "unit": "% by mass", "value": "<= 0.10"},
        {"property": "Loss on Ignition (L.O.I)", "unit": "% by mass", "value": "<= 5.0", "note": "هذا الفحص يقيس درجة التكربن والإماهة المسبقة."},
        {"property": "Insoluble Residue (I.R)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Magnesium Oxide (MgO) in clinker", "unit": "% by mass", "value": "<= 5.0", "note": "لا يوجد حد مباشر على الأسمنت في المواصفة EN 197-1، ولكن محتواه في الكلنكر."}
      ],
      "effects_of_limit_deviations": {
        "SO3": {
          "decrease": "قد يؤدي إلى شك سريع جدًا أو خاطف Flash Set.",
          "increase_within_spec": "تباطؤ طفيف في الشك، وربما انخفاض طفيف في القوة المبكرة.",
          "increase_above_spec": "خطر تمدد غير سليم وتشققات بسبب تكوين الإترنجيت المتأخر، وانخفاض القوة النهائية."
        },
        "Cl": {
          "increase": "تزيد خطر تآكل حديد التسليح، وقد تسرع زمن الشك بشكل طفيف."
        },
        "LOI": {
          "increase": "تشير إلى تكربن وإماهة مسبقة، مما يقلل فعالية الأسمنت ويخفض القوة."
        },
        "IR": {
          "increase": "تشير إلى وجود مواد خاملة عالية، مما يقلل المكونات الفعالة ويخفض القوة."
        },
        "MgO_in_clinker": {
          "increase": "يمكن أن يتبلور كـ \"بيريكلاز\" Periclase، الذي يتميه ببطء مسببًا تمددًا حجميًا كبيرًا وتشققات بعد فترة طويلة (عدم الثبات الحجمي المتأخر)."
        }
      },
      "typical_applications": [
        "المونة أو الملاط لأعمال البناء بالطوب واللياسة الداخلية والخارجية.",
        "الخرسانة العادية وغير المسلحة أو خفيفة التسليح، مثل الأساسات البسيطة، الممرات، الأرضيات المنزلية، وأعمال الفرش.",
        "العناصر الخرسانية مسبقة الصب الصغيرة التي لا تتطلب فك قوالب سريع، مثل البلوك الأسمنتي، بلاط الأرصفة، وحواف الأرصفة.",
        "تثبيت التربة وتطبيقات الطرق غير الإنشائية."
      ],
      "benefits_and_features": [
        "اقتصادي: تكلفة إنتاج معقولة مقارنة بدرجات CEM I الأعلى قوة أو الأسمنتات المتخصصة.",
        "سهل التشغيل: نعومة معتدلة تساهم في قابلية تشغيل جيدة.",
        "متعدد الاستخدامات في الأعمال العامة: مناسب لمجموعة واسعة من التطبيقات غير الإنشائية أو ذات الأحمال الخفيفة.",
        "حماية جيدة ضد تآكل حديد التسليح من الكلوريدات الموجودة في الأسمنت نفسه: بسبب الحد الأقصى المنخفض جدًا للكلوريدات وهو ≤0.10%."
      ],
      "star_rating_evaluation": {
        "sulfate_resistance": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "مقاومة محدودة إلى متوسطة."},
        "heat_of_hydration": {"stars": 3, "rating_text": "★★★☆☆", "comment": "معدل توليد حرارة معتدل."},
        "early_strength": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "تطور قوة طبيعي N."},
        "fineness": {"stars": 3, "rating_text": "★★★☆☆", "comment": "نعومة معتدلة، عادة 3100-3500 سم²/جم."},
        "carbon_footprint": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "مرتفعة بسبب النسبة العالية جدًا من الكلنكر، أكثر من 95%."},
        "production_cost_effectiveness": {"stars": 3, "rating_text": "★★★☆☆", "comment": "تكلفة إنتاج أعلى من CEM II بسبب الكلنكر، ولكن قد تكون أقل من درجات CEM I الأعلى."},
        "performance_vs_cost": {"stars": 4, "rating_text": "★★★★☆", "comment": "أداء أساسي جيد للتطبيقات العامة بتكلفة معقولة."},
        "ease_of_production_availability": {"stars": 4, "rating_text": "★★★★☆", "comment": "تقنية إنتاج راسخة ومتوفرة، على الرغم من تزايد استخدام CEM II."},
        "durability_impact_on_project_life": {"stars": 3, "rating_text": "★★★☆☆", "comment": "يوفر متانة جيدة في الظروف العادية، قد يتطلب احتياطات في البيئات القاسية."},
        "harmful_substances_chlorides": {"stars": 5, "rating_text": "★★★★★", "comment": "حد أقصى إلزامي منخفض جدًا للكلوريدات، وهو ≤0.10%."},
        "optimal_use_application": {"stars": 5, "rating_text": "★★★★★", "comment": "المونة أو الملاط للأغراض العامة مثل البناء واللياسة، والخرسانة غير الإنشائية أو ذات الأحمال الخفيفة. في هذه التطبيقات تتوافق خصائص الأسمنت - القوة المعتدلة، التصلب الطبيعي، قابلية التشغيل الجيدة المفترضة، التكلفة المعقولة - تمامًا مع المتطلبات، دون الحاجة لدفع تكلفة إضافية لقوة أعلى أو تصلب أسرع أو خصائص خاصة غير ضرورية."}
      }
    },
    {
      "name_with_color_prefix": "G CEM I 32.5R",
      "technical_name": "CEM I 32.5R",
      "standard_name_display": "GRAY CEM I 32.5R, EN 197-1",
      "definition": "يُعرف الأسمنت بشكل عام، وفقًا للمواصفة الأوروبية EN 197-1،بأنه مادة رابطة هيدروليكية، أي مادة غير عضوية مطحونة طحنًا ناعمًا، عند خلطها بالماء، تشكل عجينة تتصلب وتكتسب قساوة بفعل تفاعلات وعمليات الإماهة، وبعد تصلبها، تحتفظ بقوتها وثباتها حتى تحت الماء. الخاصية \"الهيدروليكية\" هي جوهر وظيفة الأسمنت. يُشترط في أسمنت CEM المطابق للمواصفة EN 197-1 أنه عند خلطه بشكل مناسب مع الركام والماء، يكون قادرًا على إنتاج خرسانة أو مونة تحتفظ بقابليتها للتشغيل لفترة كافية، وتحقق مستويات مقاومة محددة، بالإضافة إلى امتلاكها ثباتًا حجميًا طويل الأمد. يعود التصلب الهيدروليكي لأسمنت CEM بشكل أساسي إلى إماهة سيليكات الكالسيوم. يجب أن يكون مجموع نسب أكسيد الكالسيوم الفعال CaO وثاني أكسيد السيليكون الفعال SiO₂ في أسمنت CEM على الأقل 50% بالكتلة. يُصنف الأسمنت CEM I 32.5R ضمن فئة الأسمنت البورتلندي العادي CEM I،مما يعني أنه يحتوي على أعلى نسبة من الكلنكر البورتلندي K،حيث تبلغ 95% على الأقل من كتلته مقارنة بأنواع الأسمنت الأخرى. تشير علامة \"32.5\" إلى فئة مقاومة الضغط، وتعني أن الحد الأدنى لمقاومة الضغط القياسية لمونة الأسمنت بعد 28 يومًا يجب ألا يقل عن 32.5 ميجا باسكال MPa،وألا يتجاوز 52.5 ميجا باسكال. الحرف \"R\" هو اختصار لكلمة \"Rapid\" أي سريع، ويشير إلى أن هذا الأسمنت يتمتع بمقاومة مبكرة عالية High Early Strength،مما يميزه عن أسمنت فئة N ذي التصلب العادي Normal hardening.",
      "composition": {
        "clinker_k": {
          "percentage": ">= 95% من كتلته",
          "details": [
            "يُصنع الكلنكر عن طريق تلبيد خليط محدد بدقة من المواد الخام، وهي وجبة خام أو عجينة أو ملاط، تحتوي على عناصر مثل CaO، Al₂O₃، SiO₂، و Fe₂O₃.",
            "يجب أن يتكون الكلنكر من ثلثي كتلته على الأقل من سيليكات الكالسيوم، أساسًا الأليت C₃S والبيليت C₂S.",
            "يجب ألا تقل نسبة CaO/SiO₂ بالكتلة عن 2.0.",
            "يجب ألا يتجاوز محتوى أكسيد المغنيسيوم MgO في الكلنكر 5.0% بالكتلة."
          ]
        },
        "minor_additional_constituents": {
          "percentage": "<= 5% من مجموع كتلتي الكلنكر والمكونات الثانوية",
          "description": "هي مواد معدنية غير عضوية طبيعية أو مشتقة من عملية إنتاج الكلنكر، أو مكونات أخرى محددة، تُستخدم لتحسين بعض الخصائص الفيزيائية للأسمنت، مثل قابلية التشغيل أو الاحتفاظ بالماء. يمكن أن تكون خاملة أو ذات خصائص هيدروليكية طفيفة، أو هيدروليكية كامنة، أو بوزولانية. يجب ألا تزيد طلب الأسمنت للماء، أو تضعف مقاومة الخرسانة، أو تقلل حماية حديد التسليح.",
          "allowed_materials": [
            "خبث الأفران العالية S", "غبار السيليكا D", "البوزولانا الطبيعية P", "البوزولانا الطبيعية المحروقة Q", "الرماد المتطاير السيليسي V", "الرماد المتطاير الكلسي W", "الطفلة المحروقة T", "الحجر الجيري L (CaCO₃ ≥ 75%)", "الحجر الجيري النقي LL (CaCO₃ ≥ 75% و TOC ≤ 0.20%)"
          ]
        },
        "calcium_sulfate": {
          "percentage_typical": "3% - 5%",
          "purpose": "تُضاف إلى المكونات الأخرى أثناء التصنيع للتحكم في الشك. تعمل على تنظيم تفاعل ألومينات ثلاثي الكالسيوم C₃A مع الماء لمنع الشك السريع جدًا Flash Set.",
          "forms": ["جبسًا (CaSO₄·2H₂O)", "هيميهيدرات (CaSO₄·½H₂O)", "أنهيدريت (CaSO₄)", "أي خليط منها"]
        },
        "chemical_additives": {
          "total_percentage_max": "<= 1% (المضافات العضوية لا تتجاوز 0.5% على أساس جاف)",
          "examples": "مساعدات الطحن Grinding aids",
          "notes": "تُضاف لتحسين عملية التصنيع أو خصائص الأسمنت. يجب ألا تعزز تآكل حديد التسليح أو تضعف خصائص الأسمنت أو الخرسانة."
        }
      },
      "mandatory_physical_properties": [
        {"property": "Compressive Strength (2 days)", "unit": "MPa", "value": ">= 10", "note": "هذا المتطلب هو السمة المميزة لفئة \"R\" ضمن فئة القوة 32.5."},
        {"property": "Compressive Strength (28 days)", "unit": "MPa", "value_min": ">= 32.5", "value_max": "<= 52.5"},
        {"property": "Initial Setting Time (Vicat)", "unit": "minutes", "value": ">= 75"},
        {"property": "Soundness (Le Chatelier expansion)", "unit": "mm", "value": "<= 10"},
        {"property_note": "النعومة Fineness: خاصية هامة ولكن لا يوجد حد رقمي إلزامي عام في المواصفة، تعتمد على الأداء. يميل أسمنت R لأن يكون مطحونًا بدرجة نعومة أعلى مقارنة بأسمنت N للمساهمة في تسريع الإماهة وتطور القوة المبكرة. النعومة العالية قد تزيد حرارة الإماهة والطلب على الماء والانكماش اللدن. القيم النموذجية لأسمنت R قد تكون في نطاق 3500 إلى 4000 سم²/جم بطريقة بلين."}
      ],
      "mandatory_chemical_properties": [
        {"property": "Sulfur Trioxide (SO₃)", "unit": "% by mass", "value": "<= 3.5", "note": "بعض المواصفات قد تسمح بـ 4.0% لأنواع خاصة."},
        {"property": "Chloride Content (Cl⁻)", "unit": "% by mass", "value": "<= 0.10", "note": "يهدف لحماية حديد التسليح."},
        {"property": "Magnesium Oxide (MgO)", "unit": "% by mass", "value": "<= 5.0", "note": "ينطبق أيضًا على الكلنكر لمنع التمدد غير السليم طويل الأمد."},
        {"property": "Loss on Ignition (L.O.I)", "unit": "% by mass", "value": "<= 5.0", "note": "يقيس الماء المرتبط كيميائيًا وثاني أكسيد الكربون الناتج عن التكربن أو الحجر الجيري كمكون ثانوي."},
        {"property": "Insoluble Residue (I.R)", "unit": "% by mass", "value": "<= 5.0", "note": "تمثل المواد الخاملة أو الشوائب السيليسية غير المتفاعلة."}
      ],
      "effects_of_limit_deviations": {
        "SO3": {
            "decrease_optimal": "قد يؤدي إلى \"شك خاطئ\" False Set أو \"شك سريع جدًا\" Flash Set، وصعوبة في استخدام الخرسانة، وضعف في تطور القوة المبكرة.",
            "increase_above_max_3.5": "خطر \"تكوين الإترنجيت المتأخر\" DEF مسببًا تمدد وتشققات، وانخفاض في القوة النهائية."
        },
        "Cl_minus": {
            "decrease": "لا يوجد تأثير سلبي معروف، بل هو أفضل لمتانة الخرسانة المسلحة.",
            "increase_above_max_0.10": "زيادة كبيرة ومباشرة في خطر تآكل حديد التسليح، وكسر الطبقة الواقية عليه، مما يؤدي لتكون الصدأ، تشقق الخرسانة، وتقليل العمر التشغيلي للمنشأ."
        },
        "MgO": {
            "decrease": "لا يُعرف أن له تأثير سلبي.",
            "increase_above_max_5_as_periclase": "تمدد غير سليم للخرسانة على المدى الطويل قد يستغرق أشهراً أو سنوات نتيجة إماهة البيريكلاز البطيئة وتحوله إلى هيدروكسيد المغنيسيوم Mg(OH)₂، مسببًا تشققات وتدهور."
        },
        "LOI": {
            "decrease": "يشير إلى أن الأسمنت طازج ولم يتعرض للتكربن أو الإماهة المسبقة بشكل كبير، وهذا إيجابي.",
            "increase_above_max_5.0": "يشير إلى تكربن الأسمنت، أي تفاعل CaO مع CO₂ لتكوين CaCO₃ الخامل نسبيًا، أو إماهة مسبقة للأسمنت، أي تفاعل جزء منه مع الرطوبة، مما يقلل كمية المركبات الفعالة ويضعف الأداء وتطور القوة. قد يشير أيضًا لوجود كمية زائدة من الحجر الجيري الناعم غير المحسوب."
        },
        "IR": {
            "decrease": "يدل على درجة نقاوة أعلى للمكونات الأسمنتية المتفاعلة.",
            "increase_above_max_5.0": "تعني وجود كمية أكبر من المواد الخاملة أو الشوائب السيليسية التي لا تساهم في المقاومة، مما \"يخفف\" تركيز المركبات الفعالة ويقلل الكفاءة."
        }
      },
      "typical_applications": [
        "الخرسانة مسبقة الصب Precast Concrete: يعتبر هذا التطبيق هو الأمثل. القوة المبكرة العالية تسمح بفك القوالب مبكرًا، وزيادة معدل دوران استخدام القوالب، ومناولة ونقل العناصر المنتجة بعد فترة قصيرة، مما يسرع الإنتاج ويحسن اقتصاديات المصنع.",
        "أعمال الخرسانة في الطقس البارد Cold Weather Concreting: تفاعله الأسرع ومعدل توليده للحرارة الأعلى في البداية يساعد في تعويض تباطؤ تفاعلات الإماهة بسبب البرودة، والحفاظ على درجة حرارة الخرسانة، واكتساب قوة كافية لمقاومة أضرار الصقيع مبكرًا.",
        "أعمال الإصلاح السريع Rapid Repair Works: مناسب لإصلاح الطرق، الجسور، مدارج المطارات حيث يكون الوقت حاسمًا، فقوته المبكرة تقلل وقت التوقف عن الخدمة.",
        "الخرسانة الجاهزة للأغراض العامة حيث تكون القوة المبكرة مرغوبة: يمكن أن يساعد في تسريع وتيرة البناء بالانتقال للمراحل التالية أسرع.",
        "صناعة البلاط الأسمنتي والطوب الأسمنتي والمنتجات الأسمنتية الصغيرة: تسهل القوة المبكرة عمليات المناولة والتخزين للمنتجات بعد وقت قصير من الإنتاج.",
        "أعمال الجص والمونة التي تتطلب تصلبًا سريعًا: لتقليل زمن الانتظار قبل تطبيق الطبقات التالية."
      ],
      "benefits_and_features": [
        "تطور قوة مبكرة عالية: الميزة الرئيسية، تتيح فك قوالب أسرع، تحميل مبكر، وتسريع وتيرة المشاريع.",
        "مناسب للطقس البارد: حرارة الإماهة المتولدة تساعد في مقاومة تأثير درجات الحرارة المنخفضة.",
        "كفاءة في إنتاج الخرسانة مسبقة الصب: يقلل دورات الإنتاج ويحسن اقتصاديات المصانع.",
        "تقليل وقت الإصلاحات: يسمح بإعادة فتح المنشآت للخدمة بسرعة.",
        "محتوى منخفض من الكلوريدات: يوفر حماية جيدة لحديد التسليح، حسب المواصفة ≤0.10%."
      ],
      "star_rating_evaluation": {
        "sulfate_resistance": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "مقاومة محدودة إلى متوسطة ما لم يصمم خصيصًا لذلك."},
        "heat_of_hydration": {"stars": 3, "rating_text": "★★★☆☆", "comment": "يميل لتوليد حرارة إماهة أعلى وبمعدل أسرع بسبب محتواه العالي من الكلنكر وخاصية \"R\". التقييم في الكتاب يبدو أنه يعكس \"معدل حرارة الإماهة والنشاط المبكر\" حيث أعطاه نجمتين فقط، مشيراً إلى أنه غير مرغوب في الصبات الكبيرة."},
        "early_strength": {"stars": 5, "rating_text": "★★★★★", "comment": "السمة \"R\" تعني تصميم لتحقيق قوة مبكرة عالية."},
        "fineness": {"stars": 3, "rating_text": "★★★☆☆", "comment": "يميل لأن يكون مطحونًا بدرجة نعومة أعلى للمساهمة في القوة المبكرة، مع توازن لتجنب مشاكل مفرطة."},
        "carbon_footprint": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "بصمة كربونية عالية بسبب النسبة العالية جدًا من الكلنكر، أكثر من 95%."},
        "production_cost_effectiveness": {"stars": 3, "rating_text": "★★★☆☆", "comment": "تكلفة إنتاج أعلى من الأسمنت المخلوط، الطحن الإضافي لـ \"R\" قد يزيد التكلفة قليلاً."},
        "performance_vs_cost": {"stars": 4, "rating_text": "★★★★☆", "comment": "أداؤه في القوة المبكرة يمكن أن يوفر تكاليف كبيرة في الموقع مما يعوض التكلفة الأولية."},
        "ease_of_production_availability": {"stars": 4, "rating_text": "★★★★☆", "comment": "عملية إنتاج قياسية ومواد خام متوفرة، يعتبر سهل التوفر."},
        "durability_impact_on_project_life": {"stars": 3, "rating_text": "★★★☆☆", "comment": "يوفر متانة جيدة في الظروف العادية، الأسمنت المخلوط قد يكون أفضل في الظروف القاسية."},
        "harmful_substances_chlorides": {"stars": 4, "rating_text": "★★★★☆", "comment": "حد أقصى صارم للكلوريدات ≤0.10%. ملاحظة: الكتاب أعطى 5 نجوم للنوع 32.5N لنفس محتوى الكلوريدات."},
        "optimal_use_application": {"stars": 5, "rating_text": "★★★★★", "comment": "الخرسانة مسبقة الصب Precast Concrete: هذا التطبيق يعتبر الأمثل، حيث أن القوة المبكرة العالية تسمح بفك القوالب بسرعة، وزيادة معدل دوران استخدام القوالب، ومناولة ونقل العناصر المنتجة بعد فترة قصيرة، مما يسرع عملية الإنتاج الكلية ويحسن اقتصاديات المصنع."}
      }
    },
{
      "name_with_color_prefix": "G CEM I 42.5N",
      "technical_name": "CEM I 42.5N",
      "standard_name_display": "GRAY CEM I 42.5N, EN 197-1",
      "definition": "يُعرف أسمنت بورتلاند الرمادي من النوع CEM I 42.5N بأنه مادة رابطة هيدروليكية، تتفاعل كيميائيًا مع الماء، وهي عملية الإماهة، لتشكل عجينة تتصلب وتكتسب مقاومة ومتانة، وتحافظ على هذه الخصائص حتى تحت الماء. يتم إنتاجه وفقًا للمواصفة الأوروبية EN 197-1. يُعد مكونًا جوهريًا في تحضير الخرسانة والملاط ويستخدم في مختلف مجالات الهندسة المدنية والإنشاءات. دلالات الرموز وفقًا للمواصفة EN 197-1: CEM I: يشير إلى أن الأسمنت ينتمي للفئة الرئيسية الأولى \"أسمنت بورتلندي\"، ويتميز بمحتوى كلنكر بورتلندي لا يقل عن 95% من مجموع المكونات الرئيسية والثانوية. 42.5: يمثل رتبة مقاومة الانضغاط الدنيا للأسمنت بعد 28 يومًا، أي ≥ 42.5 ميجا باسكال، والحد الأقصى هو 62.5 ميجا باسكال. N: يشير إلى أن الأسمنت يتمتع بمعدل \"مقاومة مبكرة عادية\" Normal Early Strength، ويكتسب قوته بشكل أكثر تدريجيًا في الأيام الأولى مقارنة بالنوع R السريع Rapid Early Strength، مما ينعكس عادةً في انبعاث حرارة إماهة أقل. هذا التطور التدريجي للقوة غالبًا ما يكون مصحوبًا بانبعاث حراري أبطأ وأقل كثافة، مما يجعل أسمنت النوع \"N\" خيارًا مفضلاً في صب العناصر الخرسانية ذات الحجم الكبير أو في الأجواء الحارة. إن اعتماد هذا النوع من الأسمنت على المواصفة EN 197-1 يعني أنه قد استوفى مجموعة محددة وصارمة من المتطلبات المتعلقة بتركيبه وخصائصه، مما يمنح المستخدمين ثقة في جودته واتساق أدائه.",
      "composition": {
        "clinker_k": {
          "percentage": ">= 95% من مجموع المكونات الرئيسية والثانوية.",
          "details_clinker_production": "ينتج الكلنكر عن طريق حرق خليط متجانس من مواد خام، أساسها الحجر الجيري والطين، عند حوالي 1450 درجة مئوية.",
          "main_crystalline_compounds": {
            "alite_c3s": "أليت Ca₃SiO₅ أو C₃S: يساهم بشكل رئيسي في القوة المبكرة والنهائية.",
            "belite_c2s": "بيليت Ca₂SiO₄ أو C₂S: يتفاعل أبطأ، مساهمًا في القوة على المدى الطويل.",
            "tricalcium_aluminate_c3a": "ألومينات ثلاثي الكالسيوم Ca₃Al₂O₆ أو C₃A: يتفاعل بسرعة، يساهم في الشك الأولي وحرارة الإماهة المبكرة، ويؤثر على مقاومة الكبريتات.",
            "tetracalcium_aluminoferrite_c4af": "ألومنيوم حديد رباعي الكالسيوم Ca₂(Al,Fe)₂O₅ أو C₄AF: يساهم بشكل أقل في القوة، يؤثر على لون الأسمنت."
          }
        },
        "minor_additional_constituents": {
          "percentage": "<= 5% بالكتلة من مجموع المكونات الرئيسية والثانوية.",
          "description": "مواد معدنية غير عضوية طبيعية أو مشتقة من عملية إنتاج الكلنكر أو مواد أخرى مسموح بها.",
          "purpose": "تحسين بعض الخصائص الفيزيائية، مثل قابلية التشغيل أو الاحتفاظ بالماء.",
          "examples": ["الحجر الجيري L أو LL", "الرماد المتطاير V أو W", "خبث الأفران العالية S", "دخان السيليكا D", "البوزولانا الطبيعية P", "البوزولانا الطبيعية المكلسنة Q", "الصخر الزيتي المحروق T"],
          "limestone_toc_requirements": "عند استخدام الحجر الجيري، هناك متطلبات تتعلق بمحتوى الكربون العضوي الكلي TOC: الرمز \"LL\" يعني محتوى TOC ≤ 0.20%، والرمز \"L\" يعني محتوى TOC بين 0.20% و 0.50%."
        },
        "gypsum_calcium_sulfate": {
          "formula": "CaSO₄·2H₂O",
          "percentage_typical": "3-5%",
          "purpose": "يُضاف إلى الكلنكر أثناء الطحن، لتنظيم زمن الشك ومنع \"الشك الومضي\" Flash Setting الناتج عن التفاعل السريع لمركب C₃A. يعمل الجبس عن طريق تكوين طبقة واقية من الإترنجيت حول حبيبات C₃A."
        },
        "chemical_additives": {
            "total_percentage_max": "<= 1.0% (باستثناء الأصباغ)",
            "organic_additives_dry_basis_max": "<= 0.5%",
            "notes": "مواد تُضاف لتحسين عملية التصنيع أو خصائص الأسمنت، غير مشمولة في المكونات الرئيسية أو الثانوية أو كبريتات الكالسيوم. يجب ألا تُشجع على تآكل حديد التسليح أو تضعف خصائص الأسمنت أو الخرسانة."
        }
      },
      "mandatory_physical_properties": [
        {"property": "Compressive Strength (2 days)", "unit": "MPa", "value": ">= 10.0", "typical_values_note": "القيم النموذجية قد تكون أعلى: 13.5، 19.5، 20.55 ميجا باسكال، أو حتى 27 ميجا باسكال لأنواع خاصة مقاومة للكبريتات."},
        {"property": "Compressive Strength (28 days, standard strength)", "unit": "MPa", "value_min": ">= 42.5", "value_max": "<= 62.5"},
        {"property": "Initial Setting Time (Vicat)", "unit": "minutes", "value": ">= 60", "note": "لفئة القوة 42.5N. القيم النموذجية الفعلية عادة بين 140-190 دقيقة."},
        {"property_optional": "Final Setting Time", "note": "لا يوجد حد إلزامي مباشر في المواصفة لمعظم الأنواع، ولكن القيم النموذجية تتراوح بين 200-250 دقيقة، أي حوالي 4-5 ساعات، وقد تصل إلى 420 دقيقة كحد أقصى في بعض المصادر."},
        {"property": "Soundness (Le Chatelier expansion)", "unit": "mm", "value": "<= 10"}
      ],
      "optional_physical_properties": [
        {"property": "Fineness (Blaine)", "unit": "cm²/g", "typical_range": "3000 - 4500", "note":"القيم النموذجية لبلين لأسمنت CEM I 42.5N تتراوح عادة بين 3000 إلى 4500 سم²/جم، أي 300 إلى 450 م²/كجم. أمثلة: 3370 سم²/جم، أو 3200-3300 سم²/جم، أو 310-330 م²/كجم. أسمنت النوع \"R\" عادة أنعم."},
        {"property": "Heat of Hydration", "note": "لا يوجد حد إلزامي لـ CEM I 42.5N القياسي ما لم يصنف كـ \"LH\" أي أسمنت منخفض حرارة الإماهة. أسمنت النوع \"N\" يتميز بانبعاث حرارة أقل وتطور أبطأ للحرارة مقارنة بالنوع \"R\". القيم النموذجية لـ CEM I 42.5R، وهي أعلى من N، بعد 7 أيام: 325-375 جول/جرام. يتوقع أن تكون قيم CEM I 42.5N في هذا النطاق أو أقل قليلاً. مثال: 303 جول/جرام لـ CEM I 42.5 N-SR3 MH/LA."}
      ],
      "mandatory_chemical_properties": [
        {"property": "Sulfur Trioxide (SO₃)", "unit": "% by mass", "value": "<= 3.5", "note": "بعض المواصفات الأحدث قد تسمح بـ ≤ 4.0% لجميع الأنواع الشائعة."},
        {"property": "Chloride Content (Cl⁻)", "unit": "% by mass", "value": "<= 0.10"},
        {"property": "Magnesium Oxide (MgO)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Loss on Ignition (LOI)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Insoluble Residue (IR)", "unit": "% by mass", "value": "<= 5.0", "note": "لأسمنت CEM I الذي قد يحتوي على مكونات إضافية ثانوية."},
        {"property": "Tricalcium Aluminate (C₃A)", "note": "لا يوجد حد مباشر في المواصفة لـ CEM I 42.5N القياسي، غير المقاوم للكبريتات. محتواه النموذجي في الكلنكر البورتلندي العادي يتراوح بين 7% و 12% تقريبًا. الأنواع المقاومة للكبريتات SR لها حدود قصوى لـ C₃A."}
      ],
      "effects_of_limit_deviations": {
        "SO3": {
          "increase_optimal_range": "إذا تجاوز الحد الأمثل، مع الالتزام بحد المواصفة 3.5-4.0%، قد يسبب \"التمدد الكبريتاتي المتأخر\" DEF خاصة مع حرارة معالجة مرتفعة، مما يؤدي لتشققات وتقليل المتانة. دراسات تشير إلى أن تجاوز 3.5% يزيد خطر DEF.",
          "decrease": "يؤدي لعدم تنظيم إماهة C₃A بشكل فعال، مما يسبب \"شك خاطئ\" False Set أو \"شك ومضي\" Quick Set/Flash Set، ويؤثر سلبًا على تطور القوة وقابلية التشغيل."
        },
        "Cl_minus": {
          "increase_above_0.10": "يساهم بشكل كبير في بدء تآكل حديد التسليح، حيث يخترق الكلوريد الطبقة الواقية للحديد. الصدأ الناتج يحتل حجمًا أكبر مسببًا إجهادات وتشققات. في تركيزات عالية جدًا، قد يسبب تمدد وتشققات في الخرسانة نفسها نتيجة تكوين أملاح الكلوروأوكسي كالسيوم المتمددة. مركبات الألمنيوات C₃A و C₄AF تربط جزءًا من الكلوريد مكونة ملح فريدل، لكن هذه القدرة محدودة."
        },
        "MgO": {
          "increase_above_5.0_as_periclase": "يتسبب في تمدد غير سليم للخرسانة على المدى الطويل، شهور أو سنوات، نتيجة إماهة بطيئة للبيريكلاز وتحوله لـ Brucite أو Mg(OH)₂ مع زيادة في الحجم، مما يؤدي لتشققات.",
          "decrease": "لا يعتبر مشكلة. وجود كميات صغيرة مناسبة قد يسهل تكوين C₃S."
        },
        "LOI": {
          "increase_above_5.0": "يشير إلى \"إماهة مسبقة\" Prehydration بسبب سوء التخزين أو \"تكربن\" Carbonation بسبب التعرض لـ CO₂. كلتا العمليتين تستهلكان جزءًا من المركبات الفعالة، مما يقلل القوة. قد يشير أيضًا إلى غش أو تلوث بمواد عضوية.",
          "decrease": "مؤشر جيد على أن الأسمنت طازج ومخزن بشكل صحيح."
        },
        "IR": {
          "increase_above_5.0_with_additives": "مؤشر على وجود مواد خاملة أو شوائب، مثل رمل أو طين زائد، لا تساهم في القوة، بل تقلل تركيز المكونات الفعالة وتخفض المقاومة.",
          "decrease": "يشير لدرجة نقاء أعلى."
        }
      },
      "typical_applications": [
        "الأعمال الإنشائية العامة والخرسانة العادية والمسلحة: الخيار الأساسي للإنشاءات التي لا تتعرض لظروف بيئية قاسية أو لا تتطلب خصائص خاصة جدًا، مثل مقاومة عالية للكبريتات أو حرارة إماهة منخفضة للغاية.",
        "المباني السكنية والتجارية متعددة الطوابق: يستخدم بكفاءة في الهياكل الخرسانية، مثل الأعمدة، الكمرات، البلاطات، الأساسات، والجدران الحاملة.",
        "الخرسانة مسبقة الصب Precast Concrete Elements: مناسب لإنتاج وحدات خرسانية جاهزة، مثل البلوكات، بلاط الأرصفة، الأنابيب، أعمدة الإنارة، والعناصر الإنشائية غير المسلحة أو المسلحة بشكل خفيف، التي لا تتطلب فك قوالب فائق السرعة.",
        "بعض تطبيقات البنية التحتية: يمكن استخدامه في الطرق الخرسانية، الأرصفة، الجسور الصغيرة، والأنفاق التي لا تتعرض لبيئات كيميائية عدوانية ولا تتطلب حرارة إماهة منخفضة جدًا.",
        "أعمال اللياسة Plastering والملاط Mortar والأرضيات Flooring: يستخدم بشكل شائع في تحضير الملاط لهذه الأعمال.",
        "تثبيت التربة Soil Stabilization: يمكن استخدامه لتحسين خواص التربة وزيادة قدرتها على تحمل الأحمال."
      ],
      "benefits_and_features": [
        "قوة نهائية موثوقة وعالية نسبيًا: 42.5 - 62.5 ميجا باسكال، مناسبة لمعظم التطبيقات الإنشائية.",
        "تطور قوة مبكرة معتدل Normal: يقلل من معدل انبعاث حرارة الإماهة، مما يحد من الإجهادات الحرارية المبكرة والتشققات، خاصة في العناصر متوسطة الحجم أو في الأجواء المعتدلة إلى الحارة.",
        "تكلفة اقتصادية معقولة وتوفر واسع: يجعله خيارًا جذابًا للمشاريع ذات الميزانيات المحدودة دون التضحية بالجودة الأساسية.",
        "متانة جيدة في الظروف البيئية العادية: عند تصميم الخرسانة وتنفيذها ومعالجتها بشكل صحيح.",
        "قابلية تشغيل جيدة للخرسانة الطازجة: يسهل عمليات الخلط والنقل والصب والدمك.",
        "محتوى منخفض من الكلوريدات: ≤0.10%، يوفر حماية جيدة لحديد التسليح."
      ],
      "star_rating_evaluation": {
        "final_compressive_strength": {"stars": 4.5, "rating_text": "★★★★☆", "comment": "قوة قياسية ممتازة 42.5-62.5 ميجا باسكال."},
        "early_strength_development": {"stars": 3, "rating_text": "★★★☆☆", "comment": "النوع \"N\"، تطور قوة معتدل، ≥10 ميجا باسكال بعد يومين."},
        "workability": {"stars": 4, "rating_text": "★★★★☆", "comment": "يوفر قابلية تشغيل جيدة، ويتوافق جيدًا مع المضافات الكيميائية."},
        "general_durability_and_lifespan": {"stars": 3.5, "rating_text": "★★★☆☆", "comment": "متانة جيدة في البيئات غير العدوانية، تقل في البيئات القاسية."},
        "sulfate_resistance": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "مقاومة منخفضة إلى متوسطة للنوع القياسي."},
        "heat_of_hydration": {"stars": 3, "rating_text": "★★★☆☆", "comment": "النوع \"N\"، انبعاث حرارة معتدل، أقل من النوع \"R\"."},
        "carbon_footprint_environmental_impact": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "الأعلى بين أنواع الأسمنت بسبب نسبة الكلنكر العالية 95-100%."},
        "economic_cost_and_availability": {"stars": 5, "rating_text": "★★★★★", "comment": "من أكثر الأنواع شيوعًا وتوفرًا، سعره تنافسي."},
        "health_and_safety": {"stars": 3, "rating_text": "★★★☆☆", "comment": "يتطلب إجراءات سلامة عند التعامل معه كأي أسمنت بورتلندي، مثل تهيج وغبار. يتم التحكم في الكروم السداسي."},
        "versatility_of_use": {"stars": 4, "rating_text": "★★★★☆", "comment": "مناسب لمجموعة واسعة من التطبيقات العامة والقياسية."},
        "optimal_use_application": {"stars": 5, "rating_text": "★★★★★", "comment": "الخرسانة المسلحة للهياكل الإنشائية في المباني السكنية والتجارية القياسية. يوفر توازنًا مثاليًا بين القوة النهائية الموثوقة وتطور القوة المبكرة المعتدل، مما يقلل من معدل انبعاث حرارة الإماهة ويحد من التشققات. تكلفة اقتصادية معقولة وتوفر واسع. متانة جيدة في الظروف العادية وقابلية تشغيل جيدة. تشير بعض المصادر لإمكانية استخدامه حتى في المباني الشاهقة."}
      },
      "usage_contraindications_or_precautions": [
        "الأعمال البحرية أو الخرسانة المعرضة لمياه البحر، بسبب الكلوريدات والكبريتات.",
        "البيئات ذات المحتوى العالي من الكبريتات.",
        "الخرسانة الكتلية Mass Concrete التي تتطلب حرارة إماهة منخفضة جدًا، يفضل CEM III أو CEM IV أو CEM V.",
        "الأعمال في المياه ذات الملوحة العالية."
      ]
    },
    {
      "name_with_color_prefix": "G CEM I 42.5R",
      "technical_name": "CEM I 42.5R",
      "standard_name_display": "GRAY CEM I 42.5R, EN 197-1",
      "definition": "أسمنت بورتلاند الرمادي CEM I 42.5R هو مادة رابطة هيدروليكية تتصلب وتتصلد عند تفاعلها مع الماء، وتحافظ على قوتها ومتانتها حتى تحت الماء. يُنتج بشكل أساسي عن طريق طحن الكلنكر البورتلندي مع كمية مناسبة من الجبس لتنظيم زمن الشك، ويتوافق مع المواصفة الأوروبية EN 197-1. دلالات الرموز وفقًا للمواصفة EN 197-1: CEM I: يشير إلى أنه \"أسمنت بورتلندي نقي\"، حيث يشكل الكلنكر البورتلندي ما لا يقل عن 95% من كتلة الأسمنت، باستثناء الجبس والمكونات الإضافية الثانوية المسموح بها بنسب ضئيلة. 42.5: يدل على الحد الأدنى لمقاومة الانضغاط القياسية المطلوبة للأسمنت بعد 28 يومًا، وهي ≥ 42.5 ميجا باسكال، والحد الأقصى هو 62.5 ميجا باسكال. R: يشير إلى كلمة \"Rapid\" أي سريع، ويعني أن الأسمنت يتمتع بمقاومة مبكرة عالية High Early Strength بعد يومين من الخلط والمعالجة. هذه الخاصية تجعله مناسبًا للتطبيقات التي تتطلب سرعة في الإنجاز. إن التسمية الموحدة وفقًا للمواصفة EN 197-1 تسهل على المهندسين والمستخدمين اختيار الأسمنت المناسب لمشاريعهم بثقة، وتقلل من الالتباس وتسهل المقارنة بين المنتجات المختلفة.",
      "composition": {
        "clinker_k_portland_cement_clinker": {
          "percentage": "يشكل عادةً ما بين 95% و 100% من مجموع المكونات الرئيسية والثانوية، باستثناء الجبس.",
          "production_process": "ينتج عن حرق خليط متجانس من مواد خام، أساسها الحجر الجيري ومواد طينية، عند حوالي 1450 درجة مئوية.",
          "main_compounds": "أليت C₃S، بيليت C₂S، ألومينات ثلاثي الكالسيوم C₃A، وألومينات حديد رباعي الكالسيوم C₄AF.",
          "note": "النقاء العالي للكلنكر في أسمنت CEM I هو المسؤول المباشر عن خصائص القوة والتصلب."
        },
        "gypsum_calcium_sulfate": {
          "formula": "CaSO₄·2H₂O",
          "percentage_typical": "عادة لا تتجاوز 5%",
          "purpose": "يُضاف إلى الكلنكر أثناء الطحن النهائي بنسبة قليلة، لتنظيم زمن الشك ومنع الشك الفوري Flash Set الناتج عن التفاعل السريع لمركب C₃A."
        },
        "minor_additional_constituents_macs": {
          "percentage": "يمكن أن يحتوي على ما يصل إلى 5% بالكتلة من هذه المكونات.",
          "description": "هي مواد معدنية طبيعية غير عضوية مختارة أو مشتقة من عملية إنتاج الكلنكر، أو مكونات رئيسية أخرى مثل الحجر الجيري المطحون، الرماد المتطاير، خبث الأفران، بنسب لا تتجاوز 5%.",
          "purpose_primary": "تحسين بعض الخواص الفيزيائية، مثل قابلية التشغيل أو الاحتفاظ بالماء. لا يُشترط بالضرورة أن تكون لها خصائص هيدروليكية أو بوزولانية بهذه النسبة.",
          "requirements": "يجب ألا تزيد طلب الأسمنت للماء، أو تضعف مقاومة الخرسانة، أو تقلل حماية حديد التسليح."
        },
        "note_on_composition": "إن تركيب أسمنت CEM I 42.5R يعكس توازنًا دقيقًا بين النقاء العالي للكلنكر، لتحقيق القوة العالية والتصلب السريع، وإضافة كميات محسوبة من الجبس، للتحكم في تفاعلات الإماهة الأولية وضمان قابلية التشغيل، مع مرونة محدودة لإضافة مكونات ثانوية لتحسينات طفيفة."
      },
      "mandatory_physical_properties": [
        {"property": "Initial Setting Time", "unit": "minutes", "value": ">= 60", "note": "وفقًا لـ EN 197-1 لفئة 42.5R. القيم النموذجية الفعلية قد تكون أعلى: 155 دقيقة، أو ضمن نطاق 210 ± 30 دقيقة، أو > 75 دقيقة."},
        {"property_optional": "Final Setting Time", "note": "لا يوجد حد إلزامي مباشر في المواصفة لمعظم الأنواع، لكن القيم النموذجية قد تكون حوالي 203 دقيقة أو 250 دقيقة أو > 420 دقيقة."},
        {"property": "Soundness (Le Chatelier expansion)", "unit": "mm", "value": "<= 10", "typical_values_note": "القيم النموذجية الفعلية غالبًا أقل بكثير: 1.0 ملم أو 0.0 - 1.3 ملم."},
        {"property": "Compressive Strength (2 days)", "unit": "MPa", "value": ">= 20.0", "typical_values_note": "القيم النموذجية الفعلية قد تكون أعلى: 23، 24، أو حتى 29-36 ميجا باسكال أو 28-35 ميجا باسكال."},
        {"property": "Compressive Strength (28 days, standard strength)", "unit": "MPa", "value_min": ">= 42.5", "value_max": "<= 62.5", "typical_values_note": "القيم النموذجية الفعلية غالبًا في منتصف هذا النطاق أو أعلاه: 50، 52.6، أو حتى 57-62 ميجا باسكال."}
      ],
      "optional_physical_properties": [
        {"property": "Fineness (Blaine Specific Surface Area)", "note": "لا يوجد حد إلزامي في EN 197-1 لمعظم الأنواع، لكنها مهمة لمعدل الإماهة وتطور القوة. القيم النموذجية لأسمنت CEM I 42.5R تتراوح عادةً بين 3200 سم²/جم إلى ما يزيد عن 4000 سم²/جم. أمثلة من الكتاب: 3400-3900 سم²/جم، 3275 سم²/جم، حد أدنى 3200 سم²/جم مع قيمة نموذجية 3800 سم²/جم، أو حد أدنى 2800 سم²/جم مع قيمة نموذجية 4062 سم²/جم، أو 3210 سم²/جم. النعومة العالية تساهم في تطور القوة المبكرة بشكل أسرع وزيادة حرارة الإماهة."},
        {"property": "Heat of Hydration", "note": "تكون عالية نسبيًا في أسمنت CEM I 42.5R بسبب محتواه العالي من الكلنكر، خاصة C₃S و C₃A، ودرجة نعومته العالية. لا تحدد المواصفة EN 197-1 حدودًا للحرارة إلا للأسمنت المصنف كـ \"LH\" أي منخفض الحرارة، وهو لا ينطبق عادة على النوع \"R\". قيمة نموذجية لحرارة إماهة CEM I 42.5R عند 41 ساعة: حوالي 260.1 جول/جرام، وهي ليست منخفضة. الحد الأقصى لأسمنت LH هو 270 جول/جرام بعد 7 أيام."}
      ],
      "mandatory_chemical_properties": [
        {"property": "Sulfur Trioxide (SO₃)", "unit": "% by mass", "value": "<= 4.0", "note": "بعض المصادر تشير إلى حدود أضيق لبعض المنتجات مثل ≤ 3.5%، أو قيم نموذجية مثل 2.71% أو 3.2 ± 0.2%."},
        {"property": "Chloride Content (Cl⁻)", "unit": "% by mass", "value": "<= 0.10", "typical_values_note": "القيم النموذجية الفعلية أقل بكثير: 0.0089% أو 0.02 – 0.03%."},
        {"property": "Magnesium Oxide (MgO)", "unit": "% by mass", "value": "<= 5.0", "typical_values_note": "القيم النموذجية الفعلية أقل: 1.42% أو 2.75%."},
        {"property": "Loss on Ignition (L.O.I)", "unit": "% by mass", "value": "<= 5.0", "typical_values_note": "القيم النموذجية: 3.13% لأسمنت عالي الكبريتات، أو 3.28%، أو 3.48%."},
        {"property": "Insoluble Residue (R.I)", "unit": "% by mass", "value": "<= 5.0", "note": "لأسمنت قد يحتوي على مكونات إضافية ثانوية. مواصفات أخرى مثل ASTM C150 قد تحدد ≤ 0.75% للنوع I النقي، أو BS 12 تحدد ≤ 1.5% للأسمنت بدون إضافات. القيم النموذجية في CEM I 42.5R منخفضة جدًا: 0.33% أو 0.15%."},
        {"property": "Tricalcium Aluminate (C₃A)", "note": "لا يوجد حد مباشر في EN 197-1 لـ CEM I 42.5R القياسي، غير المقاوم للكبريتات. محتواه النموذجي في الكلنكر البورتلندي العادي حوالي 7.92%. الأسمنت المقاوم للكبريتات SR له حدود أقل بكثير لـ C₃A."},
        {"property": "Hexavalent Chromium (Cr⁶⁺)", "value": "يجب ألا يتجاوز 2 جزء في المليون (0.0002%) عند إماهته، ويتحقق ذلك بإضافة مواد مختزلة."}
      ],
      "effects_of_limit_deviations": {
        "SO3": {
          "increase": "انخفاض القوة، تمدد زائد وتشقق، خطر تكوين الإترنجيت المتأخر DEF، خاصة مع تجاوز 3.5% وحرارة معالجة مرتفعة.",
          "decrease": "شك سريع أو وخزي Flash Set، انخفاض القوة النهائية."
        },
        "Cl_minus": {
          "increase": "تآكل حديد التسليح، تشقق وتمدد الخرسانة نتيجة تكوين أملاح الكلوروألومينات الكالسيوم المتمددة، انخفاض مقاومة الانضغاط."
        },
        "MgO": {
          "increase_as_periclase": "تمدد متأخر وغير سليم Unsoundness بعد أشهر أو سنوات، تشققات، انخفاض القوة الميكانيكية، زيادة المسامية. MgO \"الميت الحرق\" هو الأكثر ضررًا."
        },
        "LOI": {
          "increase": "إماهة مسبقة Prehydration وتكربن Carbonation، انخفاض القوة النهائية، تغير في خصائص الشك، انخفاض عام في جودة وأداء الأسمنت."
        },
        "IR": {
          "increase": "انخفاض كبير في قوة الانضغاط، ضعف في التماسك وعدم تصلب الخرسانة جيدًا، مؤشر على غش الأسمنت أو سوء جودة المواد الخام."
        }
      },
      "typical_applications": [
        "الإنشاءات الخرسانية العامة: هياكل خرسانية تقليدية، أعمال بناء عامة، أساسات، في حال عدم الحاجة لمقاومة كبريتات خاصة أو حرارة إماهة منخفضة جدًا.",
        "الخرسانة عالية المقاومة وعالية الأداء High-Strength and High-Performance Concrete: مناسب لإنتاج خرسانة ذات مقاومة عالية وأداء متميز للعناصر المعرضة لأحمال عالية أو ظروف تشغيل قاسية.",
        "الخرسانة مسبقة الصب Precast Concrete والخرسانة سابقة الإجهاد Prestressed Concrete: يوصى به بشدة لتصنيع العناصر مسبقة الصب مثل أنابيب، بلاطات، أعمدة، عوارض، ألواح واجهات، وفي الخرسانة سابقة الإجهاد، بسبب تطور القوة المبكرة السريع.",
        "الأعمال التي تتطلب مقاومة مبكرة عالية: فك القوالب بسرعة، تحميل الهيكل مبكرًا، إزالة الدعامات المؤقتة مبكرًا.",
        "الخرسانة في الأجواء الباردة Cold Weather Concreting: حرارة الإماهة العالية نسبيًا تساعد على تسريع التفاعلات وحماية الخرسانة من التجمد.",
        "المنشآت الشاهقة والجسور High-Rise Buildings and Bridges: حيث تتطلب خرسانة ذات قوة عالية وأداء موثوق.",
        "أرصفة الطرق والخرسانة الأرضية Road Pavements and Ground Concretes: قوة تحمل جيدة ومقاومة تآكل بدرجة معينة.",
        "إنتاج المونة واللصقات والمواد الكيميائية للبناء.",
        "تطبيقات القوالب المنزلقة Sliding Shuttering / Slip Molds: مناسب لإنشاء صوامع، أبراج تبريد، قلوب المباني الشاهقة، حيث سرعة تطور القوة تسمح برفع القالب بشكل مستمر."
      ],
      "benefits_and_features": [
        "قوة مبكرة عالية جدًا Rapid Hardening: الميزة الأساسية، تسرع الإنجاز وتقلل دورات الإنتاج.",
        "قوة نهائية عالية وموثوقة: مناسبة للتطبيقات الإنشائية المتطلبة.",
        "قابلية تشغيل جيدة: مع تصميم خلطة مناسب، وتوافق جيد مع المضافات.",
        "مناسب للطقس البارد: حرارة الإماهة تساعد في تسريع التصلب.",
        "كفاءة عالية في إنتاج الخرسانة مسبقة الصب.",
        "متانة جيدة في الظروف العادية وغير العدوانية.",
        "محتوى منخفض جدًا من الكلوريدات: ≤0.10%، يحمي حديد التسليح."
      ],
      "star_rating_evaluation": {
        "early_strength_development": {"stars": 5, "rating_text": "★★★★★", "comment": "السمة \"R\" والمقاومة المطلوبة بعد يومين تؤكد ذلك."},
        "final_strength": {"stars": 4, "rating_text": "★★★★☆", "comment": "يحقق مقاومة قياسية عالية 42.5-62.5 ميجا باسكال."},
        "workability": {"stars": 4, "rating_text": "★★★★☆", "comment": "يوفر قابلية تشغيل جيدة ويتوافق مع المضافات."},
        "general_durability": {"stars": 4, "rating_text": "★★★★☆", "comment": "متانة جيدة في الظروف غير القاسية عند استخدامه بشكل صحيح."},
        "sulfate_resistance_standard_type": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "يعتمد على C₃A، ما لم يكن نوع SR. يذكر الكتاب مقاومة متوسطة لمنتج عراقي محدد."},
        "heat_of_hydration_for_R_type": {"stars": 4, "rating_text": "★★★★☆", "comment": "عالية، مفيدة في بعض الحالات. التقييم يعكس \"مقدار\" الحرارة، وهي إيجابية في سياقات معينة مثل الطقس البارد."},
        "carbon_footprint": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "مرتفعة نسبيًا، لكن الكتاب أعطى نجمتين مقارنة بنجمة واحدة لـ 32.5N. نسبة الكلنكر عالية 95-100%. قد تكون هناك اختلافات بسيطة في تقييم الكتاب بين الدرجات المختلفة، لكنها تبقى عالية عمومًا لـ CEM I."},
        "cost_effectiveness": {"stars": 3, "rating_text": "★★★☆☆", "comment": "التكلفة الأولية قد تكون أعلى، لكن التوفير في وقت المشروع قد يعوض ذلك."},
        "availability": {"stars": 5, "rating_text": "★★★★★", "comment": "من أكثر الأنواع إنتاجًا وتوفرًا."},
        "cold_weather_concreting_suitability": {"stars": 5, "rating_text": "★★★★★", "comment": "حرارة الإماهة العالية تساعد في تسريع التفاعلات وحماية الخرسانة من التجمد."},
        "optimal_use_application": {"stars": 5, "rating_text": "★★★★★", "comment": "الخرسانة مسبقة الصب Precast Concrete: سرعة تطور المقاومة المبكرة الفائقة تسمح بفك القوالب بسرعة، زيادة إنتاجية المصنع، وتقليل دورة الإنتاج. نقل ومناولة العناصر مبكرًا. تطبيق الإجهاد المسبق مبكرًا. جودة سطح عالية. توافق جيد مع المضافات الكيميائية. زيادة إنتاجية معامل البلوك وتقليل الهدر."}
      },
      "usage_contraindications_or_precautions": [
        "الخرسانات الكتلية الكبيرة، بسبب حرارة الإماهة العالية، ما لم تتخذ تدابير تبريد.",
        "البيئات المعرضة لهجوم الكبريتات، ما لم يكن الأسمنت من نوع SR.",
        "يتطلب معالجة دقيقة في الأعمار المبكرة."
      ]
    },
{
      "name_with_color_prefix": "G CEM I 52.5N",
      "technical_name": "CEM I 52.5N",
      "standard_name_display": "GRAY CEM I 52.5N, EN 197-1",
      "definition": "يُعرَّف الأسمنت بأنه مادة رابطة هيدروليكية، أي مادة غير عضوية مطحونة طحنًا ناعمًا، والتي عند خلطها بالماء، تُشكل عجينة تتصلب وتكتسب قساوة بفعل تفاعلات وعمليات الإماهة. ومن الخصائص الجوهرية لهذه المادة أنها بعد التصلب، تحتفظ بقوتها وثباتها حتى تحت الماء. الأسمنت المطابق للمواصفة الأوروبية EN 197-1،وهو أسمنت CEM،يجب أن يكون قادرًا على إنتاج خرسانة أو مونة ذات قابلية تشغيل كافية، وتحقق مستويات مقاومة محددة، وتُظهر ثباتًا حجميًا على المدى الطويل. يعود التصلب الهيدروليكي بشكل أساسي إلى إماهة سيليكات الكالسيوم، وقد تساهم مركبات أخرى كالألومينات. يجب ألا يقل مجموع نسب أكسيد الكالسيوم الفعال CaO وثاني أكسيد السيليكون الفعال SiO₂ في أسمنت CEM عن 50% بالكتلة. أسمنت CEM I 52.5N هو أسمنت بورتلندي نقي CEM I،يتكون بشكل أساسي من الكلنكر البورتلندي. الرقم \"52.5\" يشير إلى الحد الأدنى لمقاومة الضغط القياسية بعد 28 يومًا، وهي ≥ 52.5 ميجا باسكال، مما يصنفه ضمن فئة الأسمنت عالي القوة. الحرف \"N\" يُشير إلى تطور قوة \"عادي\" أو \"قياسي\" Normal or Standard strength development، يميزه عن أنواع \"R\" سريعة التصلب. على الرغم من تصنيفه \"N\"، فإن قوته النهائية العالية تعني أنه يكتسب قوة مبكرة جيدة جدًا، مما يوفر توازنًا بين قوة نهائية عالية وسرعة تصلب يمكن التحكم بها، وقد يولد حرارة إماهة أقل من نظيره \"R\" بنفس درجة القوة.",
      "composition": {
        "clinker_k_portland_cement_clinker": {
          "percentage": "لا يقل عن 95% من كتلته.",
          "definition_details": "مادة هيدروليكية يجب أن تتكون من ثلثي كتلتها على الأقل من سيليكات الكالسيوم، مثل C₃S و C₂S. النسبة المتبقية تتكون من أطوار كلنكر تحتوي على الألومنيوم والحديد، مثل C₃A و C₄AF، ومركبات أخرى. يجب ألا تقل نسبة CaO/SiO₂ بالكتلة عن 2.0، وألا يتجاوز محتوى MgO في الكلنكر 5.0% بالكتلة.",
          "note": "هذه النسبة العالية من الكلنكر هي المسؤولة بشكل مباشر عن تطور القوة العالية والخصائص الهيدروليكية الممتازة."
        },
        "minor_additional_constituents_macs": {
          "percentage": "لا تزيد عن 5% من مجموع كتلتي الكلنكر والمكونات الثانوية.",
          "definition_details": "مواد معدنية طبيعية غير عضوية مختارة أو مشتقة من عملية إنتاج الكلنكر أو مكونات أخرى محددة، تُستخدم لتحسين الخصائص الفيزيائية، مثل قابلية التشغيل أو الاحتفاظ بالماء. يمكن أن تكون خاملة، أو ذات خصائص هيدروليكية طفيفة، أو هيدروليكية كامنة، أو بوزولانية. يجب تحضيرها بشكل صحيح، اختيار، تجانس، تجفيف، سحق. يجب ألا تزيد طلب الأسمنت للماء، أو تضعف مقاومة الخرسانة، أو تقلل حماية حديد التسليح.",
          "allowed_materials": ["خبث الأفران العالية S", "غبار السيليكا D", "بوزولانا طبيعية P", "بوزولانا طبيعية محروقة Q", "رماد متطاير سيليسي V", "رماد متطاير كلسي W", "طفلة محروقة T", "حجر جيري L (CaCO₃ ≥ 75%)", "حجر جيري نقي LL (CaCO₃ ≥ 75% وإجمالي كربون عضوي TOC ≤ 0.20%)"],
          "purpose_in_cem1": "في أسمنت CEM I، دورها تعديلي تكميلي لضبط الأداء، وليس مساهمة جوهرية في القوة."
        },
        "setting_regulator_calcium_sulfate": {
          "percentage_typical": "عادة بين 3% إلى 5% من كتلة الأسمنت.",
          "definition_forms": "تُضاف كبريتات الكالسيوم، جبس CaSO₄·2H₂O، أو هيمي هيدرات CaSO₄·½H₂O، أو أنهيدريت CaSO₄، أثناء الطحن للتحكم في زمن الشك ومنع الشك السريع Flash Set."
        },
        "chemical_additives": {
          "percentage_limit": "لا تتجاوز 1.0% من كتلة الأسمنت، والمضافات العضوية ≤ 0.5% على أساس جاف.",
          "definition_purpose": "مكونات غير مشمولة في التعريفات السابقة، تُضاف لتحسين عملية التصنيع أو خصائص الأسمنت. يجب ألا تعزز تآكل حديد التسليح أو تضعف خصائص الأسمنت أو الخرسانة.",
          "note_on_admixtures": "إذا أُضيفت مضافات Admixtures متوافقة مع EN 934 في المصنع، يجب الإعلان عن ترميزها."
        }
      },
      "mandatory_physical_properties": [
        {"property": "Compressive Strength (2 days)", "unit": "MPa", "value": ">= 20"},
        {"property": "Compressive Strength (28 days)", "unit": "MPa", "value": "> 52.5", "note": "المواصفة EN 197-1 عادة تحدد نطاقًا، مثل ≥ 52.5 ميجا باسكال و ≤ 72.5 ميجا باسكال لفئة 52.5."},
        {"property": "Soundness (Le Chatelier expansion)", "unit": "mm", "value": "<= 10"},
        {"property": "Initial Setting Time", "unit": "minutes", "value": ">= 45"}
      ],
      "optional_physical_properties": [
        {"property": "Fineness (Blaine)", "unit": "cm²/g", "typical_range": "3600 - 5300", "note": "أي 360 إلى 530 م²/كجم. النعومة العالية تساهم في تطور القوة المبكرة."},
        {"property": "Heat of Hydration", "note": "تكون معتدلة إلى مرتفعة نسبيًا بسبب النعومة العالية والمحتوى المرتفع من C₃S. لا يصنف عادة كـ LH أي منخفض الحرارة أو VLH أي منخفض جدًا."},
        {"property": "Density (Particle)", "unit": "kg/m³", "typical_range": "3000 - 3200", "note": "أي 3.0 إلى 3.2 جم/سم³."}
      ],
      "mandatory_chemical_properties": [
        {"property": "Sulfur Trioxide (SO₃)", "unit": "% by mass", "value": "<= 4.0"},
        {"property": "Chloride Content (Cl⁻)", "unit": "% by mass", "value": "<= 0.10"},
        {"property": "Magnesium Oxide (MgO)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Loss on Ignition (L.O.I)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Insoluble Residue (I.R)", "unit": "% by mass", "value": "<= 5.0"}
      ],
      "effects_of_limit_deviations": {
        "compressive_strength": {
            "increase_above_required": "إيجابي لجودة الأسمنت، قد يسمح بتحسين الخلطات أو زيادة عامل الأمان. لكن قوة عالية جدًا قد تصاحبها نعومة مفرطة أو C₃S مرتفع، مما يزيد حرارة الإماهة، مع خطر التشققات الحرارية في الكتل الكبيرة، والانكماش.",
            "decrease_below_required": "فشل في تلبية المواصفات، خرسانة أضعف، خطر على سلامة المنشآت. قد يتطلب زيادة محتوى الأسمنت، مما يزيد التكلفة والأثر البيئي. الأسباب: سوء جودة الكلنكر، نعومة منخفضة، تلوث المواد الخام، تلف الأسمنت بالتخزين."
        },
        "soundness_expansion": {
            "increase_above_10mm": "عدم ثبات حجم الأسمنت، يولد إجهادات داخلية عالية بعد تصلب الخرسانة، يؤدي لتشققات وتفكك، وفقدان السلامة الهيكلية. الأسباب: زيادة الجير الحر MgO أو CaO الميت الحرق Periclase، أو زيادة نسبة الجبس.",
            "decrease_near_zero": "مؤشر ممتاز على جودة الأسمنت واستقراره الحجمي."
        },
        "initial_setting_time": {
            "increase_too_long": "تأخير كبير في الإنشاء والتشطيب، زيادة الضغط الهيدروستاتيكي على القوالب، احتمالية انفصال مكونات الخرسانة، انفصال حبيبي ونزف، ضعف السطح. الأسباب: زيادة نسبة الماء/الأسمنت، انخفاض الحرارة، ملوثات عضوية، استخدام مضافات مؤخرة للشك بكميات كبيرة.",
            "decrease_below_45min": "شك سريع أو خاطف: لا يترك وقتًا كافيًا للخلط والنقل والصب والدمك، خرسانة صعبة التشغيل، فواصل باردة، ضعف في البنية النهائية. الأسباب: نقص الجبس، نعومة مفرطة، ارتفاع حرارة الجو أو المواد، ملوثات كيميائية مسرعة."
        },
        "SO3": {
          "increase_above_4.0": "تمدد داخلي ضار، هجوم كبريتات داخلي أو DEF، تشققات، تدهور المتانة. قد يؤثر على زمن الشك.",
          "decrease_too_low": "شك سريع أو خاطف، خاصة مع C₃A مرتفع، خرسانة غير قابلة للتشغيل، قوة منخفضة."
        },
        "Cl_minus": {
          "increase_above_0.10": "زيادة احتمالية تآكل حديد التسليح، تشقق وتفكك الخرسانة.",
          "decrease_near_zero": "مفيد جدًا لمتانة الخرسانة المسلحة، خاصة في البيئات القاسية."
        },
        "MgO":{
            "increase_above_5.0_as_periclase": "تمدد متأخر، شهور أو سنوات، بسبب إماهة بطيئة لـ MgO، تشققات وتلف خطير.",
            "decrease": "لا يمثل مشكلة عادة، بل يضمن ثبات الحجم."
        },
        "LOI":{
            "increase_above_5.0": "تميؤ وتكربن مسبق بسبب سوء التخزين، انخفاض القوة النهائية، تغير زمن الشك، زيادة الطلب على الماء.",
            "decrease_near_zero": "يدل على أن الأسمنت طازج ومخزن جيدًا."
        },
        "IR":{
            "increase_above_5.0": "وجود شوائب أو مواد خاملة أو مغشوشة، تقلل القوة النهائية وتؤثر سلبًا على المتانة والتجانس.",
            "decrease_near_zero": "يدل على نقاء الأسمنت وجودة التصنيع."
        }
      },
      "typical_applications": [
        "الخرسانة مسبقة الصنع عالية الأداء High-Performance Precast Concrete Elements: القوة المبكرة العالية نسبيًا، حتى كنوع \"N\" لفئة 52.5، تسمح بفك القوالب بسرعة، مما يزيد كفاءة الإنتاج.",
        "الخرسانة عالية القوة High-Strength Concrete: لإنتاج خرسانة بمقاومة ضغط تتجاوز 50 أو 60 ميجا باسكال، مطلوبة في المباني الشاهقة، الجسور، والمنشآت الصناعية الثقيلة.",
        "الهياكل الإنشائية سابقة الإجهاد Prestressed Concrete Structures: القوة العالية ضرورية لمقاومة الإجهادات العالية من كابلات الإجهاد.",
        "أعمال الخرسانة في الطقس البارد: تطور القوة الجيد يساعد على تعويض التباطؤ في تفاعلات الإماهة.",
        "أرضيات المصانع والمنشآت الصناعية: للمناطق التي تتعرض لأحمال ثقيلة وحركة مرور كثيفة.",
        "الخرسانة الجاهزة Ready-Mixed Concrete: لإنتاج خلطات ذات مواصفات عالية ومقاومة مضمونة.",
        "أعمال الترميم التي تتطلب قوة سريعة: لإعادة العنصر المرمم للخدمة بسرعة.",
        "منتجات الخرسانة المتخصصة: بلاط أرضيات عالي التحمل، طوب خرساني عالي القوة، عناصر واجهات رقيقة.",
        "الأسمنت الأبيض White CEM I 52.5N: عند إنتاجه كإسمنت أبيض، يستخدم في الأعمال المعمارية والزخرفية، مثل حجر صناعي، GRC، مونة تركيب الرخام، ترويب، لياسة ملونة."
      ],
      "benefits_and_features": [
        "قوة نهائية عالية جدًا: يوفر أمانًا هيكليًا ومتانة طويلة الأمد للمنشآت.",
        "تطور قوة مبكرة جيد، حتى كنوع \"N\": يسمح بسرعة معقولة في تقدم أعمال البناء.",
        "مناسب للتطبيقات المتطلبة: مثل الخرسانة عالية القوة وسابقة الإجهاد.",
        "متانة جيدة في الظروف المناسبة: عند استخدامه وتصميمه بشكل صحيح.",
        "محتوى منخفض جدًا من الكلوريدات: ≤0.10%، يوفر حماية ممتازة لحديد التسليح.",
        "أساس جيد للخرسانة المعمارية البيضاء، عند إنتاجه كإسمنت أبيض: يوفر لونًا ناصعًا وقوة."
      ],
      "star_rating_evaluation": {
        "sulfate_resistance": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "للنوع القياسي غير المقاوم للكبريتات."},
        "heat_of_hydration": {"stars": 3, "rating_text": "★★★☆☆", "comment": "معتدلة إلى مرتفعة نسبيًا، النوع \"N\" أفضل من \"R\" لكنه ليس منخفض الحرارة نظرًا للقوة العالية."},
        "early_strength_2_and_7_days": {"stars": 4, "rating_text": "★★★★☆", "comment": "جيدة جدًا لفئة \"N\" بقوة 52.5، ≥20 ميجا باسكال بعد يومين."},
        "fineness": {"stars": 4, "rating_text": "★★★★☆", "comment": "نعومة عالية نسبيًا لتحقيق القوة المطلوبة."},
        "carbon_footprint": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "عالية جدًا بسبب نسبة الكلنكر العالية."},
        "production_cost_effectiveness": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "أعلى من فئات القوة الأقل بسبب متطلبات الجودة والطحن."},
        "performance_vs_cost": {"stars": 4, "rating_text": "★★★★☆", "comment": "الأداء العالي يبرر التكلفة في التطبيقات المتطلبة."},
        "ease_of_production_availability": {"stars": 3, "rating_text": "★★★☆☆", "comment": "يتطلب تحكمًا أكثر دقة، قد يكون أقل توفرًا من 42.5N."},
        "durability_impact_on_project_life_stability_sustainability": {"stars": 3, "rating_text": "★★★☆☆", "comment": "متانة جيدة، لكن البصمة الكربونية تقلل التقييم البيئي."},
        "harmful_substances_chlorides_toc": {"stars": 4, "rating_text": "★★★★☆", "comment": "التزام بالحدود القياسية الصارمة."} ,
        "optimal_use_application": {"stars": 5, "rating_text": "★★★★★", "comment": "إنتاج عناصر الخرسانة مسبقة الصنع عالية الأداء High-Performance Precast Concrete Elements: القوة المبكرة العالية، حتى كـ \"N\"، تسمح بفك القوالب بسرعة وزيادة كفاءة الإنتاج. القوة النهائية العالية جدًا تضمن عناصر مسبقة الصنع ذات قدرة تحمل عالية ومتانة طويلة. الجودة والتحكم الدقيق في بيئة المصنع تسمح باستغلال خصائص الأسمنت بشكل مثالي. التوافق مع المعالجة بالبخار يستجيب جيدًا للمعالجة المسرعة. تحسين السطح النهائي، النعومة العالية تساهم في أسطح ناعمة وكثيفة. الكفاءة الاقتصادية في الإنتاج الضخم، الفوائد من سرعة الإنتاج وجودة المنتج قد تعوض التكلفة الأولية الأعلى للأسمنت. أمثلة تطبيقية: عوارض جسور مسبقة الإجهاد، ألواح واجهات معمارية معقدة، وحدات بناء جاهزة، أعمدة نقل طاقة، عناصر أنفاق."}
      },
      "usage_contraindications_or_precautions": [
        "البيئات ذات المحتوى العالي من الكبريتات، ما لم يكن الأسمنت مصنفًا كـ SR.",
        "الخرسانة الكتلية الكبيرة جدًا، بسبب حرارة الإماهة المعتدلة إلى المرتفعة، ما لم تتخذ تدابير تبريد خاصة جدًا.",
        "المشاريع ذات الميزانية المحدودة جدًا التي لا تتطلب هذا المستوى من الأداء الجمالي أو القوة."
      ]
    },
{
      "name_with_color_prefix": "G CEM I 52.5R",
      "technical_name": "CEM I 52.5R",
      "standard_name_display": "GRAY CEM I 52.5R, EN 197-1",
      "definition": "يُعرَّف الأسمنت، وفقًا للمواصفة الأوروبية EN 197-1، بأنه مادة رابطة هيدروليكية، أي مادة غير عضوية مطحونة طحنًا ناعمًا، عند خلطها بالماء، تُشكل عجينة تتصلب وتكتسب قساوة بفعل تفاعلات وعمليات الإماهة، وبعد التصلب، تحتفظ بقوتها واستقرارها حتى تحت الماء. أسمنت CEMالمطابق للمواصفة EN 197-1، يجب أن يكون قادرًا على إنتاج خرسانة أو مونة تحتفظ بقابليتها للتشغيل لفترة كافية، وتحقق مستويات مقاومة محددة، وتمتلك ثباتًا حجميًا طويل الأمد. يعود التصلب الهيدروليكي أساسًا إلى إماهة سيليكات الكالسيوم، مع إمكانية مساهمة مركبات كيميائية أخرى كالألومينات. يجب ألا يقل مجموع نسب أكسيد الكالسيوم الفعال CaO وثاني أكسيد السيليكون الفعال SiO₂ في أسمنت CEM عن 50% بالكتلة. أسمنت CEM I 52.5R هو أسمنت بورتلندي نقي CEM I،يتميز بمقاومة مبكرة عالية جدًا وقوة نهائية فائقة. الرمز \"52.5\" يشير إلى الحد الأدنى لمقاومة الضغط القياسية بعد 28 يومًا، وهي ≥ 52.5 ميجا باسكال، مما يضعه في أعلى فئات القوة. الحرف \"R\" يعني أنه أسمنت ذو مقاومة مبكرة عالية Rapid High Strength، أي أنه يكتسب جزءًا كبيرًا من قوته في الأيام الأولى، خاصة بعد يومين. هذا النوع قد يكون شحيحًا بعض الشيء ولكن إنتاجه ممكن ويتطلب تحكمًا دقيقًا في جودة الكلنكر وعمليات الطحن.",
      "composition": {
        "clinker_k_portland_cement_clinker": {
          "percentage": "يجب أن يحتوي على ما لا يقل عن 95% من الكلنكر البورتلندي بالكتلة.",
          "definition_details": "مادة هيدروليكية يجب أن تتكون من ثلثي كتلتها على الأقل من سيليكات الكالسيوم، مثل C₃S و C₂S. النسبة المتبقية تتكون من أطوار الكلنكر المحتوية على الألومنيوم والحديد ومركبات أخرى. نسبة CaO/SiO₂ يجب ألا تقل عن 2.0، ومحتوى MgO في الكلنكر يجب ألا يتجاوز 5.0% بالكتلة.",
          "note_for_R_strength": "لتحقيق مقاومة \"R\" العالية، يتطلب كلنكر ذي جودة فائقة ونسب مثالية من C₃S."
        },
        "minor_additional_constituents_macs": {
          "percentage": "لا تزيد عن 5% بالكتلة من مجموع المكونات الرئيسية والثانوية.",
          "definition_details": "مواد معدنية غير عضوية طبيعية أو مشتقة من عملية إنتاج الكلنكر، أو مكونات أخرى محددة، تُستخدم لتحسين الخصائص الفيزيائية، مثل قابلية التشغيل أو الاحتفاظ بالماء.",
          "allowed_materials": "خبث الأفران العالية S، غبار السيليكا D، بوزولانا طبيعية P، بوزولانا طبيعية محروقة Q، رماد متطاير سيليسي V، رماد متطاير كلسي W، طفلة محروقة T، حجر جيري L و LL مع شروط TOC لـ LL."
        },
        "calcium_sulfate": {
          "percentage_typical": "تُضاف بنسبة تتراوح بين 3% و 5% بالكتلة، بعد تجهيز تركيبة الكلنكر والمكونات الثانوية.",
          "purpose": "التحكم في زمن الشك ومنع الشك السريع Flash Set الناتج عن تفاعل C₃A السريع مع الماء.",
          "forms": "يمكن أن تكون جبسًا CaSO₄·2H₂O، هيمي هيدرات، أو أنهيدريت."
        },
        "chemical_additives": {
          "percentage_limit": "لا تتجاوز 1.0% بالكتلة، والمضافات العضوية ≤ 0.5% على أساس جاف.",
          "purpose": "تحسين عملية التصنيع أو خصائص الأسمنت، مثل مساعدات الطحن، ملدنات، مسرعات شك خالية من الكلوريد."
        }
      },
      "mandatory_physical_properties": [
        {"property": "Compressive Strength (2 days)", "unit": "MPa", "value": ">= 30", "note": "هذا المتطلب هو السمة المميزة لفئة \"R\" ضمن القوة 52.5."},
        {"property": "Compressive Strength (28 days, standard strength)", "unit": "MPa", "value": ">= 52.5", "note": "المواصفة EN 197-1 عادة تحدد نطاقًا علويًا أيضًا، مثل ≤ 72.5 ميجا باسكال لفئة 52.5."},
        {"property": "Initial Setting Time", "unit": "minutes", "value": ">= 45"},
        {"property": "Soundness (Le Chatelier expansion)", "unit": "mm", "value": "<= 10"}
      ],
      "optional_physical_properties": [
        {"property": "Fineness (Blaine)", "note": "تكون عالية جدًا لتحقيق المقاومة المبكرة المطلوبة. القيم النموذجية قد تتراوح بين 4500 سم²/جم إلى ما يزيد عن 6500 سم²/جم، أي 450 إلى > 650 م²/كجم."},
        {"property": "Heat of Hydration", "note": "عالية نتيجة لسرعة التفاعل العالية والنعومة الفائقة. القيم النموذجية بعد 7 أيام قد تتراوح بين 325 جول/جرام و 396 جول/جرام."}
      ],
      "mandatory_chemical_properties": [
        {"property": "Loss on Ignition (L.O.I)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Insoluble Residue (I.R)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Sulfur Trioxide (SO₃)", "unit": "% by mass", "value": "<= 4.0", "note": "الأنواع المقاومة للكبريتات SR قد يكون لها حد أقل مثل ≤ 3.5%."},
        {"property": "Chloride Content (Cl⁻)", "unit": "% by mass", "value": "<= 0.10"},
        {"property": "Magnesium Oxide (MgO)", "unit": "% by mass", "value": "<= 5.0", "note": "في الكلنكر وبالتالي في الأسمنت."}
      ],
      "effects_of_limit_deviations": {
        "compressive_strength": {
            "decrease_below_limits": "يعتبر الأسمنت غير مطابق وغير صالح للتطبيقات عالية القوة. يؤدي لضعف الهيكل، عدم تحمل الأحمال التصميمية، وزيادة التشوهات.",
            "increase_significantly": "نادر ضمن نفس النوع: قد يكون إنتاجه أكثر تكلفة، وقد يصاحبه هشاشة زائدة، حرارة إماهة عالية جدًا، وصعوبة في قابلية التشغيل."
        },
        "initial_setting_time": {
            "decrease_below_45min": "شك سريع جدًا أو وخزي: صعوبة في التعامل مع الأسمنت، فقدان سريع لقابلية التشغيل، فواصل باردة، تشققات مبكرة. الأسباب: نقص الجبس، C₃A عالي ونشط، نعومة مفرطة، حرارة عالية.",
            "increase_excessively": "شك بطيء جدًا: تأخير في الإنشاء والتشطيب، زيادة ضغط الخرسانة الطرية على القوالب، نزف وانفصال، تأخر تطور القوة المبكرة. الأسباب: زيادة الجبس، مبطئات، حرارة منخفضة، نسبة ماء/أسمنت عالية."
        },
        "soundness_expansion_gt_10mm": {
            "causes": "جير حر CaO زائد، MgO حر Periclase خشن، زيادة مفرطة في الكبريتات.",
            "effect": "أسمنت غير سليم، تمدد داخلي متأخر، تشققات واسعة، تفتت الخرسانة، انهيار المنشأ."
        },
        "LOI_gt_5.0": {
            "causes": "إماهة مسبقة وتكربن بسبب سوء التخزين أو طول مدته.",
            "effect": "انخفاض نسبة المواد الفعالة، انخفاض القوة النهائية، تغير زمن الشك، زيادة الطلب على الماء."
        },
        "IR_gt_5.0": {
            "causes": "شوائب خاملة في المواد الخام، شوائب في الجبس، غش الأسمنت.",
            "effect": "انخفاض نسبة المكونات الفعالة، انخفاض مقاومة الضغط، ضعف التماسك."
        },
        "SO3_gt_4.0_or_optimal": {
            "effect": "شك سريع كاذب False Set، تمدد زائد، خطر تكوين الإترنجيت المتأخر DEF خاصة مع حرارة معالجة عالية، تشققات، انخفاض القوة."
        },
        "Cl_minus_gt_0.10": {
            "effect_primary": "تآكل حديد التسليح، تكسير الطبقة الواقية، تشكل الصدأ، تشقق وتفتت الغطاء الخرساني، انخفاض القدرة الإنشائية.",
            "effect_aesthetic": "تأثير جمالي، بقع صدأ، خاصة للأبيض."
        },
        "MgO_gt_5.0_as_coarse_periclase":{
            "effect": "تمدد متأخر وتشقق: إماهة بطيئة للبيريكلاز لـ Mg(OH)₂ مع زيادة حجمية كبيرة، تشققات واسعة بعد أشهر أو سنوات."
        }
      },
      "typical_applications": [
        "الخرسانة عالية المقاومة التي تتطلب تطور قوة سريع: لتحميل العناصر الإنشائية مبكرًا.",
        "العناصر الخرسانية مسبقة الصب Precast Concrete Elements: مثالي لتصنيع الكمرات، الأعمدة، البلاطات، ألواح الواجهات، حيث سرعة دوران القوالب ضرورية.",
        "الإنشاءات التي تتطلب فك شدات مبكر Rapid formwork removal.",
        "أعمال الإصلاح السريع للطرق والأرصفة والمنشآت: مثل مدارج المطارات وأرضيات المصانع.",
        "الخرسانة المسبقة الإجهاد Prestressed Concrete: سواء سابقة الشد أو لاحقة الشد.",
        "الخرسانة المستخدمة في الأجواء الباردة: حرارة الإماهة العالية تساعد في تعويض تأثير البرودة.",
        "أعمال الحقن Grouting: لتثبيت الصخور أو المراسي الأرضية التي تتطلب مقاومة سريعة.",
        "الخرسانة المقذوفة Shotcrete: في بعض التطبيقات التي تتطلب تصلبًا سريعًا وقوة مبكرة.",
        "الأنابيب والأنفاق والمنشآت الخرسانية ذات المواصفات العالية.",
        "عند إنتاجه كإسمنت أبيض White CEM I 52.5R: أعمال الديكور، البلاط، الإنترلوك، الحجر الصناعي، والخرسانة المسلحة بالألياف الزجاجية GRC."
      ],
      "benefits_and_features": [
        "أعلى قوة مبكرة: يسمح بسرعة فائقة في الإنجاز وتقليل دورات الإنتاج.",
        "قوة نهائية فائقة: يوفر أمانًا هيكليًا عاليًا جدًا.",
        "مناسب للتطبيقات المتخصصة: مثل الخرسانة فائقة الأداء UHPC والعناصر المعمارية الدقيقة.",
        "كفاءة عالية في إنتاج الخرسانة مسبقة الصب وعالية الأداء.",
        "تقليل وقت أو الحاجة للمعالجة بالحرارة في الخرسانة مسبقة الصب: بسبب حرارة الإماهة العالية المتولدة طبيعيًا.",
        "محتوى منخفض جدًا من الكلوريدات: ≤0.10%، يحمي حديد التسليح."
      ],
      "star_rating_evaluation": {
        "sulfate_resistance": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "للنوع القياسي، ما لم يكن SR. محتوى C₃A المرتفع المحتمل، للحفاظ على البياض إذا كان أبيض أو لتعزيز القوة المبكرة، يجعله غير مقاوم."},
        "heat_of_hydration": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "حرارة إماهة عالية جدًا، غير مناسب للكتل الكبيرة بدون تدابير خاصة."},
        "early_strength": {"stars": 5, "rating_text": "★★★★★", "comment": "يتفوق بامتياز، ≥30 ميجا باسكال بعد يومين."},
        "fineness": {"stars": 4, "rating_text": "★★★★☆", "comment": "نعومة عالية جدًا، 400-460 م²/كجم أو أعلى، لتحقيق القوة المبكرة."},
        "carbon_footprint": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "الأعلى بسبب نسبة الكلنكر العالية جدًا ومتطلبات إنتاج القوة الفائقة واللون الأبيض، إذا كان أبيض."},
        "production_cost_effectiveness": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "الأعلى تكلفة بسبب جودة الكلنكر المطلوبة، الطحن الدقيق، والمواد الخام النقية، إذا كان أبيض."},
        "performance_vs_cost": {"stars": 3, "rating_text": "★★★☆☆", "comment": "أداء ميكانيكي وجمالي فائق، إذا أبيض، يبرر التكلفة في تطبيقات متخصصة جدًا."},
        "ease_of_production_availability": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "إنتاج معقد، مواد خام خاصة، توافر محدود، شحيح."},
        "durability_impact_on_project_life_sustainability": {"stars": 3, "rating_text": "★★★☆☆", "comment": "متانة هيكلية جيدة جدًا عند استخدامه صحيحًا، لكن البصمة الكربونية العالية تؤثر على استدامة المشروع."},
        "harmful_substances_chlorides_toc": {"stars": 5, "rating_text": "★★★★★", "comment": "التزام صارم بحدود منخفضة جدًا للكلوريدات، ونقاء المواد الخام، إذا أبيض، يقلل الشوائب."},
        "optimal_use_application": {"stars": 5, "rating_text": "★★★★★", "comment": "الخرسانة المعمارية مسبقة الصب عالية الأداء جدًا Very High-Performance Architectural Precast Concrete Elements والعناصر الإنشائية الفريدة التي تتطلب أقصى قوة مبكرة ونهائية مع لون أبيض ناصع أو ألوان مخصصة فائقة النقاء. يتيح تصميم عناصر إنشائية نحيفة جدًا أو ذات بحور كبيرة جدًا مع الحفاظ على المظهر الجمالي الفائق. مثالي للمشاريع الأيقونية والمعالم المعمارية التي تسعى للجمع بين القوة القصوى والجمال المطلق. دورات إنتاج فائقة السرعة في مصانع الصب المسبق المتخصصة."}
      },
      "usage_contraindications_or_precautions": [
        "الخرسانات الكتلية الكبيرة جدًا، بسبب حرارة الإماهة الفائقة جدًا.",
        "البيئات المعرضة لهجوم كبريتات شديد، ما لم يكن الأسمنت من نوع SR خاص جدًا ونادر جدًا.",
        "يتطلب أعلى درجات الخبرة في تصميم الخلطات والمعالجة والتحكم في الحرارة.",
        "التكلفة الباهظة جدًا والتوفر المحدود جدًا يجعله مقتصرًا على مشاريع استثنائية للغاية."
      ]
    },
    {
      "name_with_color_prefix": "W CEM I 32.5N",
      "technical_name": "CEM I 32.5N White",
      "standard_name_display": "WHITE CEM I 32.5N, EN 197-1",
      "definition": "الأسمنت بشكل عام هو مادة رابطة هيدروليكية... الأسمنت الأبيض البورتلندي CEM I 32.5N White هو نوع محدد من الأسمنت البورتلندي ينتمي إلى الفئة CEM I،أي أنه يحتوي على نسبة كلنكر بورتلندي لا تقل عن 95% بالكتلة، ويتميز بلونه الأبيض الناصع. الرقم \"32.5\" يشير إلى أن الحد الأدنى لمقاومة الضغط القياسية للأسمنت بعد 28 يومًا هو 32.5 نيوتن/مم² أو ميجا باسكال. الحرف \"N\" يدل على أن الأسمنت ذو تطور قوة \"عادي\" Normal، أي ليس سريع التصلد R وليس بطيء التصلد L. يتم الحصول على اللون الأبيض من خلال انتقاء دقيق للمواد الخام المستخدمة في إنتاج الكلنكر، بحيث تكون فقيرة جدًا في أكاسيد المعادن الملونة، وبشكل خاص أكسيد الحديد Fe₂O₃ وأكسيد المنغنيز MnO₂. عادةً ما تكون نسبة Fe₂O₃ أقل من 0.35% إلى 0.5%، ونسبة MnO₂ أقل من 0.03% في الكلنكر الأبيض. كما يجب أن يحقق درجة بياض عالية، قيمة L* في نظام CIELAB أكبر من 85. عملية الإنتاج تتطلب تحكمًا صارمًا في الحرق والتبريد لمنع تكون أطوار ملونة.",
      "composition": {
        "clinker_k_white_portland_cement_clinker": {
          "percentage": "لا يقل عن 95% بالكتلة من الأسمنت.",
          "definition_details": "يُصنع بتسخين مزيج دقيق من مواد خام، مثل CaCO₃، SiO₂، Al₂O₃، وكميات ضئيلة جدًا من Fe₂O₃ في حالة الكلنكر الأبيض، حتى التلبيد. يجب أن يتكون من ثلثي كتلته على الأقل من سيليكات الكالسيوم C₃S و C₂S، وألا تقل نسبة CaO/SiO₂ عن 2.0، وألا يتجاوز محتوى MgO فيه 5.0%.",
          "white_clinker_specificity": "مواد خام عالية النقاوة، مثل حجر جيري نقي، كاولين، رمل سيليكا نقي، قليلة المحتوى من أكاسيد التلوين. قد يتطلب درجات حرارة حرق أعلى أو تعديلات في نسب المواد الخام لضمان التلبيد الكامل.",
          "typical_mineral_composition_bogue": {
            "C3S_Alite": "نسبة مرتفعة، قد تتراوح بين 50-70%، للمساهمة في القوة.",
            "C2S_Belite": "يتناسب عكسيًا مع C₃S، يساهم في القوة على المدى الطويل.",
            "C3A_Tricalcium_Aluminate": "قد تكون نسبته أعلى في الكلنكر الأبيض مقارنة بالرمادي، قد تصل إلى 10-15% أو أكثر، بسبب انخفاض الحديد. يؤثر على سرعة التفاعل، حرارة الإماهة، ومقاومة الكبريتات.",
            "C4AF_Tetracalcium_Aluminoferrite": "تكون نسبته منخفضة جدًا، عادة أقل من 1-2%، وهو العامل الرئيسي في تحقيق اللون الأبيض."
          }
        },
        "minor_additional_constituents_macs": {
          "percentage": "لا تزيد عن 5% بالكتلة من مجموع المكونات الرئيسية والثانوية.",
          "definition_details": "مواد معدنية غير عضوية طبيعية أو مشتقة من إنتاج الكلنكر، تُستخدم لتحسين الخصائص الفيزيائية.",
          "allowed_for_white": "الحجر الجيري النقي الأبيض LL هو الخيار الأكثر شيوعًا. يمكن استخدام الكاولين المعالج حراريًا P أو Q، أو غبار السيليكا الأبيض إذا توفر. معظم الأنواع الأخرى S, V, W, T غالبًا ما تكون داكنة."
        },
        "calcium_sulfate": {
          "percentage_typical": "تُضاف عادة بنسبة تتراوح بين 3% إلى 5% من كتلة الأسمنت النهائية.",
          "purpose_and_purity": "تنظيم زمن الشك ومنع الشك السريع. يجب أن يكون الجبس المستخدم عالي النقاوة وخاليًا من الشوائب الملونة."
        },
        "chemical_additives": {
          "percentage_limit": "لا تتجاوز 1.0% بالكتلة، والمضافات العضوية ≤ 0.5% على أساس جاف.",
          "purpose_for_white": "تحسين عملية التصنيع أو خصائص الأسمنت. في الأسمنت الأبيض، قد تُستخدم مساعدات طحن أو محسنات للبياض أو مشتتات لون، مع الحرص على عدم التأثير على اللون الأبيض."
        }
      },
      "mandatory_physical_properties": [
        {"property": "Compressive Strength (2 days)", "unit": "MPa", "value": ">= 10.0"},
        {"property": "Compressive Strength (28 days, standard strength)", "unit": "MPa", "value_min": ">= 32.5", "value_max": "<= 52.5"},
        {"property": "Initial Setting Time", "unit": "minutes", "value": ">= 75"},
        {"property": "Soundness (Le Chatelier expansion)", "unit": "mm", "value": "<= 10"}
      ],
      "optional_physical_properties_for_white": [
        {"property": "Fineness (Blaine)", "unit": "cm²/g", "typical_range": "3500 - 5000", "note": "أي 350 إلى 500 م²/كجم. يتميز الأسمنت الأبيض غالبًا بنعومة أعلى من الرمادي."},
        {"property": "Whiteness (L* value, CIELAB)", "value": "> 85%"}
      ],
      "mandatory_chemical_properties": [
        {"property": "Sulfur Trioxide (SO₃)", "unit": "% by mass", "value": "<= 3.5"},
        {"property": "Chloride Content (Cl⁻)", "unit": "% by mass", "value": "<= 0.10"},
        {"property": "Magnesium Oxide (MgO)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Loss on Ignition (L.O.I)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Insoluble Residue (I.R)", "unit": "% by mass", "value": "<= 5.0"},
        {"property_note_for_white": "محتوى أكاسيد التلوين، مثل Fe₂O₃ و MnO₂، يجب أن يكون منخفضًا جدًا، مثال Fe₂O₃ < 0.35-0.5%."}
      ],
      "effects_of_chemical_limit_deviations": {
        "SO3_gt_3.5": "خطر تمدد كبريتاتي متأخر DEF، تشققات، انخفاض القوة النهائية، شك كاذب.",
        "SO3_decrease": "شك سريع أو خاطف Flash Set، صعوبة في التشغيل، تطور قوة منخفض.",
        "Cl_minus_gt_0.10": "خطر كبير لتآكل حديد التسليح، تشقق الخرسانة، تقليل العمر الافتراضي للمنشأ. قد تسرع الشك وتؤثر على القوة.",
        "MgO_gt_5.0_as_periclase": "تمدد متأخر للخرسانة، تمدد المغنيسيا، تشققات وتلف خطير.",
        "LOI_gt_5.0": "يشير لتلف الأسمنت بالإماهة المسبقة أو التكربن، يقلل فعاليته وقوته النهائية، يزيد زمن الشك وقابلية التشغيل قد تقل.",
        "IR_gt_5.0": "وجود مواد خاملة أو شوائب، تقلل القوة، قد تزيد الحاجة للماء وتؤثر على الكثافة والتجانس."
      },
      "effects_of_fineness_and_main_compounds_for_white": {
        "fineness_increase": "تطور أسرع للقوة المبكرة، حرارة إماهة أعلى، قابلية تشغيل أفضل، تقليل النضح. لكن قد تزيد الطلب على الماء، الانكماش، والحساسية للتدهور بالتخزين.",
        "fineness_decrease": "تطور أبطأ للقوة، حرارة إماهة أقل، زيادة النضح، قابلية تشغيل أقل، قد يتطلب معالجة أطول.",
        "C3S_high": "قوة مبكرة عالية، حرارة إماهة عالية.",
        "C2S_high_at_C3S_expense": "قوة مبكرة أقل، حرارة إماهة أقل، قوة متأخرة أفضل، قد يحسن الديمومة.",
        "C3A_high_potential_in_white": "شك أولي سريع، حرارة إماهة عالية، مقاومة كبريتات منخفضة.",
        "C4AF_very_low_essential_for_white": "هو المسؤول عن اللون الرمادي، انخفاضه قد يتطلب تعديل ظروف الحرق."
      },
      "typical_applications": [
        "الخرسانة المعمارية البيضاء أو الملونة: واجهات مباني، عناصر معمارية بارزة، جدران داخلية وخارجية.",
        "العناصر الخرسانية مسبقة الصب: ألواح واجهات، وحدات كسوة، بلاط أرصفة مزخرف، أثاث حضري، أحجار بناء اصطناعية.",
        "أعمال الترميم الدقيقة للآثار والمباني التاريخية: للحفاظ على المظهر الأصيل.",
        "مونات التشطيب، اللياسة أو البياض، البيضاء أو الملونة: للجدران الداخلية والخارجية.",
        "بلاط وأرضيات التيرازو: كمادة رابطة للركام الملون، يبرز جمال وألوان الركام.",
        "أعمال الحشو Grouting ذات المتطلبات اللونية: لفواصل بلاط السيراميك أو البورسلين أو الحجر الطبيعي.",
        "المنحوتات والأعمال الفنية الخرسانية.",
        "بطانات حمامات السباحة.",
        "علامات الطرق وملاعب التنس."
      ],
      "benefits_and_features": [
        "لون أبيض ناصع ومظهر جمالي فائق: الميزة الرئيسية، يسمح بالحصول على ألوان فاتحة وزاهية عند إضافة الأصباغ.",
        "قوة ميكانيكية جيدة، فئة 32.5N: مناسب للعديد من التطبيقات الإنشائية والديكورية.",
        "تطور قوة مبكرة عادي N: يوفر وقت عمل مناسب مع اكتساب قوة معقولة.",
        "محتوى منخفض جدًا من المواد الضارة: خاصة الكلوريدات والكروم سداسي التكافؤ، عادة، مما يعزز المتانة والسلامة.",
        "قابلية تشغيل جيدة: خاصة مع النعومة العالية المحتملة.",
        "أساس ممتاز للخرسانة الملونة عالية الجودة."
      ],
      "star_rating_evaluation": {
        "sulfate_resistance": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "للنوع القياسي، يعتمد على محتوى C₃A."},
        "heat_of_hydration": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "حرارة إماهة معتدلة إلى مرتفعة بسبب النعومة والمحتوى العالي المحتمل لـ C₃A."},
        "early_strength": {"stars": 3, "rating_text": "★★★☆☆", "comment": "النوع \"N\"، قوة مبكرة عادية، ≥10 ميجا باسكال بعد يومين."},
        "fineness": {"stars": 4, "rating_text": "★★★★☆", "comment": "عادةً ما يكون أنعم من الرمادي لتحسين البياض."},
        "carbon_footprint": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "التقييم في الكتاب نجمتان لـ White R 32.5، عالية بسبب الكلنكر العالي ومتطلبات إنتاج الأبيض."},
        "production_cost_effectiveness": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "تكلفة إنتاج عالية جدًا بسبب المواد الخام النقية وعمليات التصنيع الخاصة."},
        "performance_vs_cost": {"stars": 3, "rating_text": "★★★☆☆", "comment": "القيمة الجمالية تبرر التكلفة في التطبيقات المتخصصة."},
        "ease_of_production_availability": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "إنتاج متخصص وتوافر محدود."},
        "durability_impact_on_project_life_sustainability": {"stars": 4, "rating_text": "★★★★☆", "comment": "متانة جيدة، وثبات لوني."},
        "harmful_substances_chlorides_toc": {"stars": 5, "rating_text": "★★★★★", "comment": "منخفض جدًا بسبب نقاء المواد الخام."},
        "optimal_use_application": {"stars": 5, "rating_text": "★★★★★", "comment": "الواجهات المعمارية المتميزة والعناصر الزخرفية مسبقة الصب عالية الجودة ذات اللون الأبيض الناصع أو الملون بألوان زاهية. يوفر قاعدة مثالية للون والمظهر. يسمح بتحكم دقيق في اللون والتشطيب في بيئة المصنع. يمكن تحقيق تفاصيل معقدة ودقيقة. ديمومة لونية جيدة. يبرر تكلفته الأعلى في هذه التطبيقات ذات القيمة الجمالية العالية."}
      }
    },
    {
      "name_with_color_prefix": "W CEM I 32.5R",
      "technical_name": "CEM I 32.5R White",
      "standard_name_display": "WHITE CEM I 32.5R, EN 197-1",
      "definition": "يُعرَّف الأسمنت، وفقًا للمواصفة الأوروبية EN 197-1، بأنه \"مادة رابطة هيدروليكية... الأسمنت البورتلندي الأبيض من النوع CEM I 32.5R White هو منتج متخصص. تشير علامة \"CEM I\" إلى أنه أسمنت بورتلندي يتكون بشكل أساسي من الكلنكر، لا تقل نسبته عن 95% من الكتلة الكلية باستثناء الجبس والمكونات الثانوية المحدودة. السمة \"أبيض\" تفرض متطلبات صارمة على عملية الإنتاج والمواد الخام، منخفضة المحتوى جدًا من أكاسيد التلوين كأكسيد الحديد Fe₂O₃ وأكسيد المنغنيز MnO،لتحقيق درجة بياض عالية. فئة القوة \"32.5R\" تشير إلى أن الأسمنت يحقق مقاومة ضغط قياسية لا تقل عن 32.5 ميجا باسكال بعد 28 يومًا، مع خاصية تطور المقاومة المبكرة العالية Rapid - R. المحددات المذكورة في كتابك لهذا المنتج، والتي تتضمن مقاومة ضغط <42.5 ميجا باسكال بعد 28 يومًا ومقاومة ≥ 20 ميجا باسكال بعد يومين، تضعه في فئة أداء أعلى من 32.5R القياسية، مما يشير لمنتج متميز.",
      "composition": {
        "clinker_k_white_portland_cement_clinker": {
          "percentage": "لا يقل عن 95% من كتلته.",
          "definition_properties": "يُصنع الكلنكر بتسخين مزيج دقيق من مواد خام مثل CaCO₃، SiO₂، Al₂O₃، وكميات ضئيلة جدًا من Fe₂O₃. يتكون من ثلثي كتلته على الأقل من سيليكات الكالسيوم C₃S و C₂S. يجب ألا تقل نسبة CaO/SiO₂ عن 2.0، وألا يتجاوز محتوى MgO فيه 5.0%. يتميز الكلنكر الأبيض بانخفاض شديد في Fe₂O₃، عادة < 0.5% أو حتى < 0.25%، وأكاسيد التلوين الأخرى. هذا يؤدي لتغيير في نسب الأطوار المعدنية مقارنة بالكلنكر الرمادي، مثل ارتفاع C₃S و C₃A، وانخفاض كبير أو غياب C₄AF."
        },
        "minor_additional_constituents_macs": {
          "percentage": "لا تزيد عن 5% من إجمالي كتلة الأسمنت.",
          "definition_function": "مواد معدنية لتحسين الخصائص الفيزيائية. يجب أن تكون بيضاء اللون أو فاتحة جدًا.",
          "allowed_for_white": "الحجر الجيري النقي الأبيض LL هو الأكثر شيوعًا. غبار السيليكا الأبيض D ممكن إذا توفر نقيًا لونيًا. معظم المواد الأخرى S, P, Q, V, W, T غالبًا ما تكون داكنة وغير مناسبة ما لم تتوفر أنواع بيضاء خاصة."
        },
        "calcium_sulfate": {
          "percentage_typical": "تُضاف بنسبة تتراوح بين 3% و 5% من الكتلة الكلية.",
          "purpose_and_purity": "تنظيم زمن الشك ومنع الشك السريع Flash Set الناتج عن تفاعل C₃A السريع. يجب أن يكون الجبس المستخدم أبيض اللون وعالي النقاوة."
        },
        "chemical_additives": {
          "percentage_limit": "لا تتجاوز 1% بالكتلة، والمضافات العضوية ≤ 0.5% على أساس جاف.",
          "purpose_for_white": "تحسين التصنيع أو الخصائص، مثل مساعدات الطحن، محسنات البياض، مع الحرص على عدم التأثير على اللون الأبيض."
        }
      },
      "mandatory_physical_properties": [
        {"property": "Compressive Strength (2 days)", "unit": "MPa", "value": ">= 20"},
        {"property": "Compressive Strength (28 days, standard strength)", "unit": "MPa", "value_min": ">= 32.5", "value_max": "<= 52.5", "note": "مع الأخذ بالاعتبار أن المنتج \"متميز\" وقد يحقق قيمًا أعلى ضمن هذا النطاق أو يتجاوزه قليلاً، على الرغم من أن الكتاب ذكر قيم متضاربة <42.5 و >62.5 التي لا تتوافق مع فئة 32.5R."},
        {"property": "Initial Setting Time", "unit": "minutes", "value": ">= 75"},
        {"property": "Soundness (Le Chatelier expansion)", "unit": "mm", "value": "<= 10"}
      ],
      "optional_physical_properties_for_white": [
        {"property": "Fineness (Blaine)", "unit": "cm²/g", "typical_range": "3200-4420", "note": "وقد تصل إلى 420 م²/كجم (4200 سم²/جم) لفئة 52.5 كما ذكر سابقًا، هنا للـ 32.5R يتميز بنعومة عالية."},
        {"property": "Whiteness (L* value, CIELAB)", "value": "> 85%"}
      ],
      "mandatory_chemical_properties": [
        {"property": "Sulfur Trioxide (SO₃)", "unit": "% by mass", "value": "<= 4.0"},
        {"property": "Chloride Content (Cl⁻)", "unit": "% by mass", "value": "<= 0.10"},
        {"property": "Magnesium Oxide (MgO)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Loss on Ignition (L.O.I)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Insoluble Residue (I.R)", "unit": "% by mass", "value": "<= 5.0"}
      ],
      "effects_of_chemical_limit_deviations": {
        "SO3": {
            "decrease_optimal": "شك سريع Flash Set أو شك كاذب False Set، صعوبة في التشغيل، ضعف القوة المبكرة.",
            "increase_above_4_percent": "خطر تمدد كبريتاتي متأخر DEF، تشققات، انخفاض القوة النهائية."
        },
        "Cl_minus_gt_0.10": "خطر كبير لتآكل حديد التسليح، تشقق الخرسانة، تقليل العمر الافتراضي. قد تسرع الشك وتؤثر على القوة.",
        "MgO_gt_5.0_as_periclase": "تمدد متأخر للخرسانة، تمدد المغنيسيا، تشققات وتلف خطير.",
        "LOI_gt_5.0": "يشير لتلف الأسمنت بالإماهة المسبقة أو التكربن، يقلل فعاليته وقوته النهائية، يزيد زمن الشك، ويقلل قابلية التشغيل.",
        "IR_gt_5.0": "وجود مواد خاملة أو شوائب، تقلل القوة، قد تؤثر على قابلية التشغيل والطلب على الماء."
      },
      "typical_applications": [
        "العناصر المعمارية مسبقة الصب: ألواح واجهات، أعمدة زخرفية، كورنيش، درابزينات، وحدات بناء زخرفية.",
        "أعمال الواجهات والمونة البيضاء Stucco/Renders and White Mortars: للياسة الخارجية والداخلية، ولصق الطوب أو الحجر الأبيض.",
        "أرضيات التيرازو Terrazzo Flooring: مادة رابطة مثالية للركام الملون.",
        "مونة لصق وملء فواصل البلاط Tile Grout and Pointing Mortar: خاصة مع البلاط الفاتح.",
        "المنحوتات والأعمال الفنية الخرسانية.",
        "حمامات السباحة Swimming Pools: للبطانة النهائية.",
        "حواجز الطرق وعلامات الأرصفة: لزيادة وضوح الرؤية.",
        "ترميم المباني الأثرية والتاريخية: لتحقيق تطابق لوني.",
        "الخرسانة ذاتية التنظيف أو المضيئة، مع إضافات خاصة: كقاعدة لتطوير أنواع متقدمة."
      ],
      "benefits_and_features": [
        "لون أبيض ناصع ومظهر جمالي فائق: الميزة الأساسية، يسمح بالحصول على ألوان فاتحة وزاهية عند إضافة الأصباغ.",
        "قوة مبكرة عالية، خاصية \"R\": تسرع الإنجاز، وتسمح بفك قوالب أسرع، وتحميل مبكر.",
        "قوة ميكانيكية جيدة، فئة 32.5، وقد تصل لأداء 42.5 حسب مواصفات المستخدم: مناسب للعديد من التطبيقات الإنشائية والديكورية.",
        "محتوى منخفض جدًا من المواد الضارة: خاصة الكلوريدات والكروم سداسي التكافؤ، عادة.",
        "قابلية تشغيل جيدة وجودة سطح عالية: بفضل النعومة المحتملة.",
        "كفاءة في إنتاج الخرسانة مسبقة الصب: يقلل دورات الإنتاج."
      ],
      "star_rating_evaluation": {
        "sulfate_resistance": {"stars": 3, "rating_text": "★★★☆☆", "comment": "يعتمد على محتوى C₃A الفعلي، قد يكون أعلى إذا كان نوع SR."},
        "heat_of_hydration": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "حرارة إماهة مرتفعة نسبيًا بسبب النعومة وخاصية \"R\"."},
        "early_strength": {"stars": 5, "rating_text": "★★★★★", "comment": "خاصية \"R\" وقيمة المستخدم ≥20 ميجا باسكال بعد يومين ممتازة."},
        "fineness": {"stars": 4, "rating_text": "★★★★☆", "comment": "عالية إلى عالية جدًا، مفيدة للقوة المبكرة والبياض."},
        "carbon_footprint": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "الكتاب أعطى نجمتين لـ White N 52.5، عالية بسبب الكلنكر العالي ومتطلبات إنتاج الأبيض وخاصية \"R\"."},
        "production_cost_effectiveness": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "الكتاب أعطى نجمتين لـ White N 52.5، تكلفة إنتاج عالية بسبب المواد الخام النقية وعمليات التصنيع الخاصة."},
        "performance_vs_cost": {"stars": 3, "rating_text": "★★★☆☆", "comment": "القيمة الجمالية والأداء الميكانيكي يبرران التكلفة في التطبيقات المتخصصة."},
        "ease_of_production_availability": {"stars": 3, "rating_text": "★★★☆☆", "comment": "إنتاج متخصص وتوافر أقل من الرمادي، لكنه ممكن."},
        "durability_impact_on_project_life_sustainability": {"stars": 4, "rating_text": "★★★★☆", "comment": "متانة جيدة وثبات لوني، مع مراعاة البصمة الكربونية."},
        "harmful_substances_chlorides_toc": {"stars": 4, "rating_text": "★★★★☆", "comment": "منخفض جدًا بسبب نقاء المواد الخام."},
        "optimal_use_application": {"stars": 5, "rating_text": "★★★★★", "comment": "العناصر المعمارية مسبقة الصب Architectural Precast Concrete Elements: بياض فائق ومظهر جمالي. قوة مبكرة عالية \"R\" تسرع الإنتاج. إمكانية تشكيل تفاصيل دقيقة وجودة سطح عالية. تناسق لوني وجودة مضمونة."}
      }
    },
    {
      "name_with_color_prefix": "W CEM I 42.5N",
      "technical_name": "CEM I 42.5N White",
      "standard_name_display": "WHITE CEM I 42.5N, EN 197-1",
      "definition": "أسمنت CEM I 42.5N White هو أسمنت بورتلندي يتميز بلونه الأبيض الناصع، وينتمي إلى فئة الأسمنت البورتلندي الخالص CEM I وفقًا للمواصفة الأوروبية EN 197-1،مما يعني أنه يتكون بنسبة لا تقل عن 95% من الكلنكر البورتلندي الأبيض. الرقم \"42.5\" يشير إلى أن الحد الأدنى لمقاومة الانضغاط القياسية للأسمنت بعد 28 يومًا هو 42.5 ميجا باسكال. الحرف \"N\" يدل على أن الأسمنت يتمتع بمعدل تطور قوة \"عادي\" Normal Early Strength، أي أنه يكتسب قوته بشكل تدريجي وليس بسرعة فائقة كما في فئة \"R\" أو ببطء كما في فئة \"L\". يتم الحصول على اللون الأبيض من خلال اختيار مواد خام نقية جدًا، منخفضة المحتوى من أكاسيد الحديد والمنغنيز، وعمليات تصنيع دقيقة لتجنب التلوث اللوني. يُستخدم هذا النوع بشكل أساسي في التطبيقات التي تتطلب مظهرًا جماليًا عاليًا وقوة ميكانيكية جيدة.",
      "composition": {
        "clinker_k_white_portland_cement_clinker": {
          "percentage": "لا تقل عن 95% من كتلة الأسمنت.",
          "properties_details": "يُصنع من مواد خام نقية، حجر جيري نقي، كاولين، رمل سيليكا أبيض، منخفضة جدًا في أكاسيد التلوين مثل Fe₂O₃ < 0.35-0.5% و MnO₂ < 0.03%. قد يتطلب درجات حرارة حرق أعلى. تركيب الكلنكر الأبيض المعدني يختلف عن الرمادي، عادةً بنسبة C₄AF منخفضة جدًا ونسبة C₃A قد تكون أعلى نسبيًا."
        },
        "minor_additional_constituents_macs": {
          "percentage": "لا تزيد عن 5% بالكتلة.",
          "suitable_for_white": "الحجر الجيري النقي الأبيض LL، الكاولين المعالج حراريًا P أو Q، أو غبار السيليكا الأبيض النقي لونيًا D."
        },
        "calcium_sulfate": {
          "percentage_and_purpose": "تُضاف عادة بنسبة 3% إلى 5% لتنظيم زمن الشك. يجب أن يكون الجبس المستخدم أبيض اللون وعالي النقاوة."
        },
        "chemical_additives": {
          "percentage_and_purpose": "لا تتجاوز 1% بالكتلة. قد تشمل مساعدات طحن أو محسنات بياض، مع الحرص على عدم التأثير سلبًا على اللون الأبيض."
        }
      },
      "mandatory_physical_properties": [
        {"property": "Compressive Strength (2 days)", "unit": "MPa", "value": ">= 10.0", "typical_values_note": "القيم النموذجية الفعلية قد تكون أعلى، مثل 13.5 - 21.7 ميجا باسكال."},
        {"property": "Compressive Strength (28 days, standard strength)", "unit": "MPa", "value_min": ">= 42.5", "value_max": "<= 62.5", "typical_values_note": "القيم النموذجية الفعلية، مثل 43.5 - 50.8 ميجا باسكال."},
        {"property": "Initial Setting Time", "unit": "minutes", "value": ">= 60", "note": "لفئة 42.5N. بعض المعايير الصينية للأبيض تشير إلى > 45 دقيقة."},
        {"property_optional": "Final Setting Time", "note": "> 10 ساعات، وفقًا للمعيار الصيني للأبيض، أو حوالي 250 دقيقة كقيمة نموذجية."},
        {"property": "Soundness (Le Chatelier expansion)", "unit": "mm", "value": "<= 10"}
      ],
      "optional_physical_properties_for_white": [
        {"property": "Fineness (Blaine)", "unit": "cm²/g", "typical_range": "4290 - 4450", "alternative_range": "أو قد تصل إلى 3300-5000 سم²/جم."},
        {"property": "Whiteness (L* value, CIELAB)", "value": "عادة > 90%", "chinese_standard_note": "المعيار الصيني يشير إلى ≥ 80% أو ≥ 87% حسب الدرجة."},
        {"property": "Heat of Hydration", "note": "معتدلة بشكل عام لفئة \"N\". بعض أنواع الأبيض قد تكون ذات حرارة إماهة منخفضة، مثل 166-176 جول/جرام بعد 7 أيام."}
      ],
      "mandatory_chemical_properties": [
        {"property": "Sulfur Trioxide (SO₃)", "unit": "% by mass", "value_spec": "<= 3.5%، أو ≤ 4.0% حسب بعض المواصفات.", "actual_white_values": "القيم الفعلية للأبيض: 1.47 - 2.27%."},
        {"property": "Chloride Content (Cl⁻)", "unit": "% by mass", "value": "<= 0.10", "actual_white_values": "القيم الفعلية للأبيض: 0.018 - 0.04%."},
        {"property": "Magnesium Oxide (MgO)", "unit": "% by mass", "value": "<= 5.0", "actual_white_values": "القيم الفعلية للأبيض: 0.71 - 2.74%."},
        {"property": "Loss on Ignition (L.O.I)", "unit": "% by mass", "value": "<= 5.0", "actual_white_values": "القيم الفعلية: 1.11 - 1.57%."},
        {"property": "Insoluble Residue (I.R)", "unit": "% by mass", "value": "<= 5.0", "actual_white_values": "القيم الفعلية: 0.56 - 0.90%."},
        {"property": "Tricalcium Aluminate (C₃A)", "note": "لا يوجد حد مباشر في EN 197-1 للنوع القياسي. في الأبيض، قد يكون بين 6.6-9.0% للكلنكر العادي أو 2.0-2.6% للمقاوم للكبريتات."},
        {"property": "Alkalies (Na₂O equivalent)", "preferred_value": "< 0.6%", "purpose": "للحد من تفاعل القلوي-سيليكا."},
        {"property": "Hexavalent Chromium (Cr⁶⁺)", "typical_value": "< 2 جزء في المليون."}
      ],
      "effects_of_deviations": {
        "fineness": {
            "increase": "تطور أسرع للقوة المبكرة، حرارة إماهة أعلى، زيادة ميل للانكماش، قد يتطلب ماء أكثر.",
            "decrease": "تطور أبطأ للقوة، حرارة إماهة أقل، زيادة النزف."
        },
        "SO3": "زيادته تسبب تمدد كبريتاتي متأخر DEF وتشققات. نقصانه يسبب شك سريع أو خاطف.",
        "Cl_minus": "زيادته تسبب تآكل حديد التسليح.",
        "MgO_as_periclase": "زيادته تسبب تمدد متأخر.",
        "LOI": "زيادته تشير لإماهة مسبقة أو تكربن، وانخفاض القوة.",
        "IR": "زيادته تشير لمواد خاملة وانخفاض القوة.",
        "C3A": {
            "increase": "سرعة شك أعلى، حرارة إماهة مبكرة أعلى، مقاومة كبريتات أقل، قد يعزز البياض.",
            "decrease": "يحسن مقاومة الكبريتات، يقلل حرارة الإماهة، يبطئ الشك."
        },
        "Alkalies": "زيادتها تسبب خطر تفاعل القلوي-سيليكا ASR مع ركام نشط."
      },
      "typical_applications": [
        "الأعمال المعمارية والديكورية: واجهات، عناصر زخرفية، منحوتات، خرسانة مكشوفة بيضاء أو ملونة.",
        "العناصر الخرسانية مسبقة الصب: ألواح جدارية، وحدات كسوة، بلاط أرصفة فاخر، أثاث شوارع.",
        "بلاط وأرضيات التيرازو.",
        "مونة ربط وتكحيل البلاط، خاصة الفاتح.",
        "الجص والقصارة Stucco and Plaster البيضاء أو الملونة.",
        "أعمال ترميم المباني التاريخية والفنية.",
        "تطبيقات أخرى: تبليط حمامات السباحة، دهانات أسمنتية، أسطح عمل وأحواض."
      ],
      "benefits_and_features": [
        "لون أبيض ناصع ومظهر جمالي فائق: يسمح بألوان فاتحة وزاهية عند التلوين.",
        "قوة ميكانيكية عالية وموثوقة، فئة 42.5N: مناسب لمجموعة واسعة من التطبيقات.",
        "تطور قوة مبكرة عادي N: يوفر توازنًا جيدًا بين سرعة الإنجاز ووقت العمل.",
        "محتوى منخفض جدًا من المواد الضارة: خاصة الكلوريدات والكروم سداسي التكافؤ.",
        "قابلية تشغيل جيدة ونعومة عالية: يسهل الحصول على تشطيبات سطحية ممتازة.",
        "متانة جيدة في الظروف المناسبة.",
        "أساس ممتاز للخرسانة الملونة عالية الجودة."
      ],
      "star_rating_evaluation": {
        "sulfate_resistance": {"stars": "3-4", "rating_text": "★★★☆☆ - ★★★★☆", "comment": "يعتمد على محتوى C₃A الفعلي."},
        "heat_of_hydration": {"stars": "3-4", "rating_text": "★★★☆☆ - ★★★★☆", "comment": "معتدلة، بعض الأنواع قد تكون منخفضة الحرارة."},
        "early_strength": {"stars": 3, "rating_text": "★★★☆☆", "comment": "النوع \"N\"، قوة مبكرة عادية، ≥10 ميجا باسكال بعد يومين."},
        "fineness": {"stars": "4-5", "rating_text": "★★★★☆ - ★★★★★", "comment": "عالية جدًا لتحسين البياض والتفاعلية."},
        "carbon_footprint": {"stars": "1-2", "rating_text": "★☆☆☆☆ - ★★☆☆☆", "comment": "عالية بسبب الكلنكر العالي ومتطلبات إنتاج الأبيض."},
        "production_cost_effectiveness": {"stars": "1-2", "rating_text": "★☆☆☆☆ - ★★☆☆☆", "comment": "تكلفة إنتاج عالية."},
        "performance_vs_cost": {"stars": 3, "rating_text": "★★★☆☆", "comment": "القيمة الجمالية والأداء يبرران التكلفة في التطبيقات المتخصصة."},
        "ease_of_production_availability": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "إنتاج متخصص وتوافر محدود."},
        "durability_impact_on_project_life_sustainability": {"stars": 4, "rating_text": "★★★★☆", "comment": "متانة جيدة، وثبات لوني، مع مراعاة البصمة الكربونية."},
        "harmful_substances_chlorides_toc": {"stars": 4, "rating_text": "★★★★☆", "comment": "منخفض جدًا، خاصة الكروم والقلويات، عادة."},
        "optimal_use_application": {"stars": 5, "rating_text": "★★★★★", "comment": "العناصر الخرسانية المعمارية مسبقة الصب عالية الجودة ذات التفاصيل الدقيقة والألوان المخصصة. تحكم مطلق في اللون والمظهر في بيئة المصنع. تحقيق تفاصيل معقدة ودقيقة. متانة وأداء طويل الأمد. كفاءة اقتصادية في هذا السياق المحدد. يمكن دمجه مع تقنيات GFRC أو UHPC."}
      },
      "usage_notes_from_ocr": "هذا هو القسم الخاص بـ الأسمنت الأبيض البورتلندي CEM I 42.5N White. هل أنت جاهز للانتقال إلى القسم التالي وهو الأسمنت الأبيض البورتلندي CEM I 42.5R White؟ (هذه الجملة كانت موجودة في نهاية الصفحة 94 من OCR، لذا أضفتها هنا)."
    },
    {
      "name_with_color_prefix": "W CEM I 42.5R",
      "technical_name": "CEM I 42.5R White",
      "standard_name_display": "WHITE CEM I 42.5R, EN 197-1",
      "definition": "يُعرَّف الأسمنت، وفقًا للمواصفة الأوروبية EN 197-1، بأنه مادة رابطة هيدروليكية... أسمنت بورتلاند أبيض CEM I 42.5R White هو نوع متخصص يجمع بين القوة الميكانيكية العالية والمظهر الجمالي الفائق. \"CEM I\" يعني أنه أسمنت بورتلندي نقي، يتكون بشكل أساسي من الكلنكر بنسبة 95% إلى 100%، مع إمكانية إضافة نسبة قليلة جدًا، 0-5%، من المكونات الثانوية الإضافية. \"42.5\" هي فئة مقاومة الأسمنت، وتعني أن الحد الأدنى لمقاومة الضغط القياسية بعد 28 يومًا هو 42.5 ميجا باسكال. الحرف \"R\"يشير إلى Rapid High Strength، أي أن الأسمنت يتمتع بمقاومة مبكرة عالية، ويكتسب جزءًا كبيرًا من قوته في الأيام الأولى، خاصة بعد يومين. السمة \"أبيض\" Whiteهي الميزة المميزة، ناتجة عن استخدام مواد خام نقية جدًا منخفضة المحتوى من أكاسيد الحديد والمنغنيز والمركبات الملونة الأخرى، وعمليات تصنيع خاصة. درجة البياض، قيمة L* في نظام CIELAB،غالبًا ما تتجاوز 90%.",
      "composition": {
        "clinker_k_white_portland_cement_clinker": {
          "percentage": "لا يقل عن 95% من مجموع المكونات الرئيسية والثانوية.",
          "definition_details": "يُصنع بتلبيد خليط دقيق من مواد خام مثل CaO، SiO₂، Al₂O₃، وكميات ضئيلة من Fe₂O₃. يتكون من ثلثي كتلته على الأقل من سيليكات الكالسيوم C₃S و C₂S. نسبة CaO/SiO₂ ≥ 2.0، ومحتوى MgO ≤ 5.0%. يتميز الكلنكر الأبيض بانخفاض شديد في Fe₂O₃، عادة < 0.5% أو حتى < 0.25%، وأكاسيد التلوين الأخرى."
        },
        "minor_additional_constituents_macs": {
          "percentage": "لا تزيد عن 5% من إجمالي كتلة الأسمنت.",
          "definition_function": "مواد معدنية لتحسين الخصائص الفيزيائية. يجب أن تكون بيضاء اللون أو فاتحة جدًا.",
          "suitable_for_white": "الحجر الجيري النقي الأبيض LL، غبار السيليكا الأبيض D، إذا توفر نقيًا لونيًا."
        },
        "calcium_sulfate": {
          "percentage_and_purpose": "تُضاف عادة بنسبة 3% إلى 5% لتنظيم زمن الشك. يجب أن يكون الجبس المستخدم أبيض اللون وعالي النقاوة."
        },
        "chemical_additives": {
          "percentage_and_purpose": "لا تتجاوز 1% بالكتلة. قد تشمل مساعدات طحن أو محسنات بياض، مع الحرص على عدم التأثير على اللون الأبيض."
        }
      },
      "mandatory_physical_properties": [
        {"property": "Compressive Strength (2 days)", "unit": "MPa", "value": ">= 20"},
        {"property": "Compressive Strength (28 days, standard strength)", "unit": "MPa", "value_min": ">= 42.5", "value_max": "<= 62.5"},
        {"property": "Initial Setting Time", "unit": "minutes", "value": ">= 60", "note": "وفقًا لـ EN 197-1 لفئة 42.5R. القيم الفعلية للأبيض قد تكون أطول، مثل 106 أو 135 دقيقة."},
        {"property": "Soundness (Le Chatelier expansion)", "unit": "mm", "value": "<= 10"}
      ],
      "optional_physical_properties_for_white": [
        {"property": "Fineness (Blaine)", "unit": "m²/kg", "typical_range": "400 - 460", "note": "أي 4000-4600 سم²/جم. عالية جدًا لتحقيق خاصية \"R\"."},
        {"property": "Whiteness (L* value, CIELAB)", "typical_value": "> 90%", "example_range": "90-93% أو أعلى.", "light_reflectance": "> 85%"},
        {"property": "Heat of Hydration", "note": "مرتفعة نسبيًا بسبب النعومة العالية والمحتوى العالي من الكلنكر والفعالية العالية لمركباته، خاصة C₃S و C₃A."}
      ],
      "mandatory_chemical_properties": [
        {"property": "Sulfur Trioxide (SO₃)", "unit": "% by mass", "value": "<= 4.0", "note": "الأنواع المقاومة للكبريتات SR قد يكون لها حد أقل مثل ≤ 3.5%."},
        {"property": "Chloride Content (Cl⁻)", "unit": "% by mass", "value": "<= 0.10"},
        {"property": "Magnesium Oxide (MgO)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Loss on Ignition (L.O.I)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Insoluble Residue (I.R)", "unit": "% by mass", "value": "<= 5.0", "note_for_cem1_with_macs": "عندما يحتوي الأسمنت على مكونات ثانوية."}
      ],
      "effects_of_chemical_limit_deviations": {
        "SO3": "النقصان عن الحد الأمثل يسبب شك سريع أو خاطف Flash Set. الزيادة عن الحد المسموح به تسبب تمدد كبريتاتي متأخر DEF.",
        "Cl_minus": "الزيادة تسبب تآكل حديد التسليح.",
        "MgO_as_periclase": "الزيادة تسبب تمدد متأخر.",
        "LOI": "الزيادة تشير لإماهة مسبقة أو تكربن، وانخفاض القوة.",
        "IR": "الزيادة تشير لمواد خاملة أو شوائب، تقلل القوة، قد تؤثر على اللون."
      },
      "typical_applications": [
        "العناصر المعمارية مسبقة الصب Architectural Precast Concrete Elements: ألواح واجهات، عناصر زخرفية، حيث سرعة الإنتاج مهمة.",
        "الخرسانة عالية الأداء البيضاء أو الملونة High-Performance White or Colored Concrete: للمشاريع التي تتطلب قوة ومتانة مع جماليات خاصة.",
        "أعمال الترميم التي تتطلب قوة سريعة وتطابق لوني.",
        "المنتجات الأسمنتية التي تتطلب فك قوالب سريع ولون أبيض: مثل بعض أنواع البلاط أو الأحجار الاصطناعية.",
        "تطبيقات خاصة تتطلب تصلبًا سريعًا ومظهرًا أبيض: مثل بعض أنواع الجص أو المونة الخاصة."
      ],
      "benefits_and_features": [
        "لون أبيض ناصع ومظهر جمالي فائق.",
        "قوة مبكرة عالية جدًا، خاصية \"R\": تسرع الإنجاز، تسمح بفك قوالب مبكر.",
        "قوة نهائية عالية وموثوقة، فئة 42.5.",
        "محتوى منخفض جدًا من المواد الضارة.",
        "قابلية تشغيل جيدة وجودة سطح عالية.",
        "كفاءة في إنتاج الخرسانة مسبقة الصب."
      ],
      "star_rating_evaluation": {
        "sulfate_resistance": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "للنوع القياسي، ما لم يكن SR."},
        "heat_of_hydration": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "حرارة إماهة مرتفعة نسبيًا بسبب النعومة وخاصية \"R\"."},
        "early_strength": {"stars": 5, "rating_text": "★★★★★", "comment": "السمة \"R\" وقوة ≥20 ميجا باسكال بعد يومين ممتازة."},
        "fineness": {"stars": 4, "rating_text": "★★★★☆", "comment": "عالية إلى عالية جدًا، مفيدة للقوة المبكرة والبياض."},
        "carbon_footprint": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "عالية بسبب الكلنكر العالي ومتطلبات إنتاج الأبيض وخاصية \"R\"."},
        "production_cost_effectiveness": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "تكلفة إنتاج عالية."},
        "performance_vs_cost": {"stars": 3, "rating_text": "★★★☆☆", "comment": "القيمة الجمالية والأداء الميكانيكي يبرران التكلفة."},
        "ease_of_production_availability": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "إنتاج متخصص وتوافر محدود."},
        "durability_impact_on_project_life_sustainability": {"stars": 4, "rating_text": "★★★★☆", "comment": "متانة جيدة وثبات لوني، مع مراعاة البصمة الكربونية."},
        "harmful_substances_chlorides_toc": {"stars": 4, "rating_text": "★★★★☆", "comment": "منخفض جدًا بسبب نقاء المواد الخام."},
        "optimal_use_application": {"stars": 5, "rating_text": "★★★★★", "comment": "الخرسانة المعمارية مسبقة الصب عالية الأداء ذات الألوان الزاهية والنقوش الدقيقة. جماليات فائقة وحرية تصميمية. قوة مبكرة عالية \"R\" تسرع الإنتاج. إمكانية تشكيل تفاصيل دقيقة وجودة سطح عالية. تناسق لوني وجودة مضمونة."}
      }
    },
    {
      "name_with_color_prefix": "W CEM I 52.5N",
      "technical_name": "CEM I 52.5N White",
      "standard_name_display": "WHITE CEM I 52.5N, EN 197-1",
      "definition": "الأسمنت الأبيض البورتلندي CEM I 52.5N White هو أسمنت عالي الجودة والقوة، ينتمي إلى فئة CEM I حسب المواصفة الأوروبية EN 197-1،مما يعني أنه يتكون بشكل أساسي من الكلنكر البورتلندي الأبيض بنسبة لا تقل عن 95%. الرقم \"52.5\" يشير إلى فئة المقاومة، حيث يكون الحد الأدنى لمقاومة الانضغاط القياسية بعد 28 يومًا هو 52.5 ميجا باسكال، مما يضعه ضمن فئات الأسمنت عالي القوة جدًا. الحرف \"N\" يدل على تطور قوة \"عادي\" Normal Early Strength،مما يعني أنه على الرغم من قوته النهائية العالية جدًا، فإن اكتسابه للقوة المبكرة يكون بمعدل طبيعي وليس سريعًا جدًا كفئة \"R\". السمة \"أبيض\" White هي ما يميزه لونيًا، ويتم تحقيقها عبر استخدام مواد خام فائقة النقاوة وعمليات إنتاج دقيقة للتحكم في اللون. يُستخدم هذا النوع في التطبيقات التي تتطلب أعلى درجات الأداء الميكانيكي إلى جانب المظهر الجمالي الأبيض الناصع.",
      "composition": {
        "clinker_k_white_portland_cement_clinker": {
          "percentage": "لا تقل عن 95% من كتلة الأسمنت.",
          "properties_details": "يُنتج من مواد خام مختارة بعناية فائقة لضمان نقاء اللون، مع محتوى منخفض للغاية من أكاسيد الحديد والمنغنيز. يتطلب ظروف حرق وتبريد خاصة. لإنتاج قوة 52.5N، يجب أن يكون الكلنكر ذا جودة عالية جدًا وتركيب معدني مثالي، خاصة فيما يتعلق بنسب C₃S."
        },
        "minor_additional_constituents_macs": {
          "percentage": "لا تزيد عن 5% بالكتلة.",
          "suitable_for_white": "يجب أن تكون بيضاء اللون أو فاتحة جدًا ولا تؤثر على البياض النهائي للأسمنت."
        },
        "calcium_sulfate": {
          "notes": "تُضاف كجبس أبيض عالي النقاوة لتنظيم زمن الشك."
        },
        "chemical_additives": {
          "notes": "تُستخدم بحذر شديد وبكميات قليلة جدًا، لضمان عدم التأثير على اللون أو خصائص الأداء العالي."
        }
      },
      "mandatory_physical_properties": [
        {"property": "Compressive Strength (2 days)", "unit": "MPa", "value": ">= 20"},
        {"property": "Compressive Strength (28 days)", "unit": "MPa", "value": "> 52.5", "note": "المواصفة EN 197-1 تحدد عادة نطاقًا علويًا أيضًا لفئة 52.5، وهو ≤ 72.5 ميجا باسكال."},
        {"property": "Initial Setting Time", "unit": "minutes", "value": ">= 45"},
        {"property": "Soundness (Le Chatelier expansion)", "unit": "mm", "value": "<= 10"}
      ],
      "optional_physical_properties_for_white_high_strength": [
        {"property": "Fineness (Blaine)", "unit": "cm²/g", "typical_range": "3600 - 5300", "note": "أي 360 إلى 530 م²/كجم. عالية جدًا."},
        {"property": "Whiteness (L* value, CIELAB)", "typical_value": "> 90-92%"},
        {"property": "Heat of Hydration", "note": "معتدلة إلى مرتفعة نسبيًا بسبب النعومة العالية والمحتوى المرتفع من C₃S."}
      ],
      "mandatory_chemical_properties": [
        {"property": "Sulfur Trioxide (SO₃)", "unit": "% by mass", "value": "<= 4.0"},
        {"property": "Chloride Content (Cl⁻)", "unit": "% by mass", "value": "<= 0.10"},
        {"property": "Magnesium Oxide (MgO)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Loss on Ignition (L.O.I)", "unit": "% by mass", "value": "<= 5.0"},
        {"property": "Insoluble Residue (I.R)", "unit": "% by mass", "value": "<= 5.0"}
      ],
      "typical_applications": [
        "عناصر الخرسانة مسبقة الصب عالية الأداء جدًا High-Performance Precast Concrete Elements: مثل ألواح الواجهات الكبيرة والرقيقة، والعناصر الإنشائية المعقدة التي تتعرض لأحمال عالية.",
        "الخرسانة عالية القوة جدًا Very High-Strength Concrete: للمباني الشاهقة، الجسور ذات البحور الطويلة، والمنشآت الخاصة التي تتطلب مقاومة استثنائية.",
        "الهياكل الإنشائية سابقة الإجهاد Prestressed Concrete Structures: التي تتطلب أعلى درجات القوة والمتانة مع مظهر جمالي.",
        "المنتجات الأسمنتية المتخصصة: التي تحتاج إلى قوة ربط عالية جدًا ولون أبيض ناصع.",
        "الخرسانة فائقة الأداء البيضاء UHPC - White Ultra-High Performance Concrete: كعنصر أساسي في تركيبها."
      ],
      "benefits_and_features": [
        "أعلى درجات القوة النهائية المتاحة تجاريًا تقريبًا.",
        "لون أبيض ناصع وممتاز جدًا.",
        "تطور قوة مبكرة جيد، حتى كنوع \"N\" لهذه الفئة العالية.",
        "متانة فائقة عند التصميم والتنفيذ الصحيح.",
        "أساس مثالي لإنتاج خرسانة بيضاء أو ملونة ذات أداء ميكانيكي استثنائي."
      ],
      "star_rating_evaluation": {
        "sulfate_resistance": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "للنوع القياسي غير المقاوم للكبريتات."},
        "heat_of_hydration": {"stars": 3, "rating_text": "★★★☆☆", "comment": "معتدلة إلى مرتفعة نسبيًا، النوع \"N\" أفضل من \"R\" لكنه ليس منخفض الحرارة نظرًا للقوة العالية."},
        "early_strength_2_and_7_days": {"stars": 4, "rating_text": "★★★★☆", "comment": "جيدة جدًا لفئة \"N\" بقوة 52.5، ≥20 ميجا باسكال بعد يومين."},
        "fineness": {"stars": 4, "rating_text": "★★★★☆", "comment": "نعومة عالية نسبيًا لتحقيق القوة المطلوبة."},
        "carbon_footprint": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "عالية جدًا بسبب نسبة الكلنكر العالية ومتطلبات إنتاج القوة القصوى واللون الأبيض."},
        "production_cost_effectiveness": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "أعلى من فئات القوة الأقل بسبب متطلبات الجودة والطحن الفائق والنقاء اللوني."},
        "performance_vs_cost": {"stars": 4, "rating_text": "★★★★☆", "comment": "الأداء الفائق جدًا يبرر التكلفة في التطبيقات شديدة التطلب."},
        "ease_of_production_availability": {"stars": 3, "rating_text": "★★★☆☆", "comment": "يتطلب تحكمًا دقيقًا للغاية، قد يكون أقل توفرًا من فئات أقل."},
        "durability_impact_on_project_life_stability_sustainability": {"stars": 3, "rating_text": "★★★☆☆", "comment": "متانة فائقة، لكن البصمة الكربونية العالية تقلل التقييم البيئي."},
        "harmful_substances_chlorides_toc": {"stars": 4, "rating_text": "★★★★☆", "comment": "التزام بالحدود القياسية الصارمة، ونقاء عالٍ للمواد الخام."},
        "optimal_use_application": {"stars": 5, "rating_text": "★★★★★", "comment": "إنتاج عناصر الخرسانة مسبقة الصب عالية الأداء جدًا High-Performance Precast Concrete Elements ذات المتطلبات الجمالية والهيكلية الفائقة. القوة المبكرة والنهائية العالية جدًا تسمح بتصميم عناصر أنحف وأخف وزنًا أو ذات بحور أكبر. جودة سطح ولون لا مثيل لهما. دقة عالية في الأبعاد والتفاصيل. كفاءة اقتصادية في سياق القيمة المضافة العالية لهذه العناصر المتخصصة."}
      },
      "usage_contraindications_or_precautions": [
        "البيئات ذات المحتوى العالي من الكبريتات، ما لم يكن الأسمنت مصنفًا كـ SR.",
        "الخرسانة الكتلية الكبيرة جدًا، بسبب حرارة الإماهة المعتدلة إلى المرتفعة، ما لم تتخذ تدابير تبريد خاصة جدًا.",
        "المشاريع ذات الميزانية المحدودة جدًا التي لا تتطلب هذا المستوى من الأداء الجمالي أو القوة."
      ]
    },
    {
      "name_with_color_prefix": "W CEM I 52.5R",
      "technical_name": "CEM I 52.5R White",
      "standard_name_display": "WHITE CEM I 52.5R, EN 197-1",
      "definition": "أسمنت أبيض بورتلندي CEM I 52.5R White يمثل قمة أنواع الأسمنت البورتلندي من حيث الجمع بين أعلى درجات القوة الميكانيكية، سواء المبكرة أو النهائية، والمظهر الجمالي الأبيض الفائق. ينتمي إلى فئة CEM I حسب المواصفة الأوروبية EN 197-1،مما يعني نقاءً عاليًا للكلنكر البورتلندي الأبيض، بنسبة لا تقل عن 95%. الرقم \"52.5\" يدل على فئة المقاومة الأعلى، حيث الحد الأدنى لمقاومة الانضغاط القياسية بعد 28 يومًا هو 52.5 ميجا باسكال. الحرف \"R\" يشير إلى تطور مقاومة مبكرة عالية جدًا Rapid High Strength، مما يعني اكتساب جزء كبير من القوة النهائية في غضون الأيام الأولى، خاصة بعد يومين، حيث يكون الحد الأدنى لمقاومة الضغط 30 ميجا باسكال. السمة \"أبيض\" White تتحقق من خلال استخدام مواد خام استثنائية النقاوة وعمليات إنتاج بالغة الدقة. هذا النوع هو الخيار الأمثل للتطبيقات التي لا تقبل أي تنازلات فيما يخص القوة الفائقة، سرعة الإنجاز، والجماليات اللونية النقية. إنتاجه يتطلب تحكمًا صارمًا للغاية في جودة المواد الخام وعمليات التصنيع.",
      "composition": {
        "clinker_k_white_portland_cement_clinker": {
          "percentage": "لا يقل عن 95% من كتلة الأسمنت.",
          "properties_details": "يتطلب كلنكرًا ذا جودة استثنائية ونسب مثالية من C₃S لتحقيق التطور السريع للقوة الفائقة، مع الحفاظ على نقاء اللون. وهذا يعني مواد خام فائقة النقاء وعمليات حرق وتبريد دقيقة جدًا."
        },
        "minor_additional_constituents_macs": {
          "percentage": "لا تزيد عن 5% بالكتلة.",
          "types_for_white": "يجب أن تكون بيضاء ناصعة ولا تؤثر على الأداء الفائق أو اللون."
        },
        "calcium_sulfate": {
          "notes": "جبس أبيض فائق النقاوة، يُضاف لتنظيم الشك السريع جدًا المتوقع من هذا النوع."
        },
        "chemical_additives": {
          "notes": "تُستخدم بأقصى درجات الحذر وبكميات دقيقة، قد تشمل مساعدات طحن خاصة أو محسنات أداء لا تؤثر على اللون."
        }
      },
      "mandatory_physical_properties": [
        {"property": "Compressive Strength (2 days)", "unit": "MPa", "value": ">= 30"},
        {"property": "Compressive Strength (28 days)", "unit": "MPa", "value": ">= 52.5", "note": "وقد يتجاوز ذلك ليصل إلى الحد الأعلى للنطاق وهو ≤ 72.5 ميجا باسكال."},
        {"property": "Initial Setting Time", "unit": "minutes", "value": ">= 45"},
        {"property": "Soundness (Le Chatelier expansion)", "unit": "mm", "value": "<= 10"}
      ],
      "optional_physical_properties_very_high_performance_white": [
        {"property": "Fineness (Blaine)", "unit": "m²/kg", "typical_range": "400 - 460", "note": "أي 4000-4600 سم²/جم، وقد تصل لأكثر من 650 م²/كجم (6500 سم²/جم) في بعض الأنواع المطورة خصيصًا. فائقة جدًا."},
        {"property": "Whiteness (L* value, CIELAB)", "typical_value": "> 90-93% أو أعلى."},
        {"property": "Heat of Hydration", "note": "مرتفعة جدًا بسبب النعومة الفائقة والمحتوى العالي من الكلنكر الفعال. قد تصل إلى حوالي 350 كيلوجول/كجم بعد 7 أيام."}
      ],
      "mandatory_chemical_properties": [
        {"note": "نفس محددات CEM I 52.5N White فيما يخص SO₃، Cl⁻، MgO، L.O.I، I.R."}
        
        
        
        
        
        
      ],
      "typical_applications": [
        "الخرسانة فائقة الأداء البيضاء أو الملونة UHPC - White or Colored Ultra-High Performance Concrete: يستخدم كعنصر أساسي في إنتاج هذه الخرسانات المتقدمة جدًا.",
        "العناصر الخرسانية مسبقة الصب والإجهاد Prestressed and Precast Concrete Elements ذات المتطلبات القصوى: مثل الجسور ذات البحور الكبيرة جدًا، أو العناصر المعمارية التي تجمع بين النحافة والقوة الفائقة والجمال.",
        "أعمال الإصلاح الهيكلي السريع جدًا Very Rapid Structural Repair Works: التي تتطلب إعادة المنشأ للخدمة في أسرع وقت ممكن مع ضمان قوة عالية.",
        "تطبيقات خاصة جدًا تتطلب مقاومة ميكانيكية فائقة ولون أبيض ناصع: مثل بعض الأرضيات الصناعية المتخصصة، أو العناصر التي تتعرض لإجهادات عالية جدًا وفي نفس الوقت يكون المظهر الجمالي فيها مهمًا."
      ],
      "benefits_and_features": [
        "أعلى فئة قوة قياسية مع أعلى مقاومة مبكرة \"R\": يوفر أقصى أداء ميكانيكي ممكن.",
        "لون أبيض ناصع جدًا ومظهر جمالي لا مثيل له.",
        "تطور قوة فائق السرعة: يقلل بشكل كبير زمن الإنجاز ودورات الإنتاج.",
        "متانة استثنائية عند التصميم والتنفيذ الصحيح."
      ],
      "star_rating_evaluation": {
        "sulfate_resistance": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "للنوع القياسي، ما لم يكن SR."},
        "heat_of_hydration": {"stars": 2, "rating_text": "★★☆☆☆", "comment": "حرارة إماهة عالية جدًا، غير مناسب للكتل الكبيرة بدون تدابير خاصة جدًا."},
        "early_strength": {"stars": 5, "rating_text": "★★★★★", "comment": "الأفضل على الإطلاق، ≥30 ميجا باسكال بعد يومين."},
        "fineness": {"stars": 5, "rating_text": "★★★★★", "comment": "نعومة فائقة لتحقيق القوة المبكرة القصوى."},
        "carbon_footprint": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "الأعلى على الإطلاق بسبب متطلبات الإنتاج الفائقة."},
        "production_cost_effectiveness": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "الأعلى تكلفة."},
        "performance_vs_cost": {"stars": 3, "rating_text": "★★★☆☆", "comment": "يبرر التكلفة فقط في التطبيقات المتخصصة جدًا التي لا بديل لها."},
        "ease_of_production_availability": {"stars": 1, "rating_text": "★☆☆☆☆", "comment": "الأصعب في الإنتاج والأقل توفرًا، شحيح جدًا."},
        "durability_impact_on_project_life_sustainability": {"stars": 3, "rating_text": "★★★☆☆", "comment": "متانة هيكلية فائقة، لكن البصمة الكربونية تحد من استدامته."},
        "harmful_substances_chlorides_toc": {"stars": 5, "rating_text": "★★★★★", "comment": "التزام بالحدود المنخفضة جدًا، ونقاء فائق للمواد الخام."},
        "optimal_use_application": {"stars": 5, "rating_text": "★★★★★", "comment": "الخرسانة المعمارية مسبقة الصب عالية الأداء جدًا Very High-Performance Architectural Precast Concrete Elements والعناصر الإنشائية الفريدة التي تتطلب أقصى قوة مبكرة ونهائية مع لون أبيض ناصع أو ألوان مخصصة فائقة النقاء. يتيح تصميم عناصر إنشائية نحيفة جدًا أو ذات بحور كبيرة جدًا مع الحفاظ على المظهر الجمالي الفائق. مثالي للمشاريع الأيقونية والمعالم المعمارية التي تسعى للجمع بين القوة القصوى والجمال المطلق. دورات إنتاج فائقة السرعة في مصانع الصب المسبق المتخصصة."}
      },
      "usage_contraindications_or_precautions": [
        "الخرسانات الكتلية الكبيرة جدًا، بسبب حرارة الإماهة الفائقة جدًا.",
        "البيئات المعرضة لهجوم كبريتات شديد، ما لم يكن الأسمنت من نوع SR خاص جدًا ونادر جدًا.",
        "يتطلب أعلى درجات الخبرة في تصميم الخلطات والمعالجة والتحكم في الحرارة.",
        "التكلفة الباهظة جدًا والتوفر المحدود جدًا يجعله مقتصرًا على مشاريع استثنائية للغاية."
      ]
    }
  ]
}